[{"by":"armchairhacker","id":30750526,"kids":[30750758,30752913,30755923,30751132,30756442,30759188,30756305,30751949],"parent":30749134,"text":"Built-in unit types are underrated. F# has them. Other languages should seriously consider adding them, despite the fact that feature bloat is a serious language problem and they&#x27;re relatively niche: they are that useful, and I honestly don&#x27;t think they would interfere much with other features.<p>Something like:<p><pre><code>    unit type Meters = m\n    unit type Seconds = s\n\n    function sleep(time: Int[s]): void\n\n    val speed = 5.4 m&#x2F;s &#x2F;&#x2F; Type = Float[m&#x2F;s]\n    val distance = parseFloat(prompt(&#x27;enter time&#x27;)) * 1 m &#x2F;&#x2F; Convert unitless to meters just by multiplying\n    val time = distance &#x2F; speed &#x2F;&#x2F; Type = Float[s]\n    print(&quot;${time}&quot;) &#x2F;&#x2F; Prints &quot;# s&quot;\n    print(&quot;${time &#x2F; 1 s} seconds&quot;) &#x2F;&#x2F; Prints &quot;# seconds&quot;\n\n    val complexUnit = 7 * 1 lbf&#x2F;in2 &#x2F;&#x2F; 7 lbf&#x2F;in2\n    &#x2F;&#x2F; != 7 psi (too hard to infer) but you can write a converter function\n    function toPsi&lt;N : Numeral&gt;(value: N[lbf&#x2F;in2]): N[psi] {\n        return value * 1 psi*in2&#x2F;lbf\n    }\n</code></pre>\nIt requires extending number parsing, type parsing (if the brackets aren&#x27;t already part e.g. in TypeScript), and extending types to support units of measurement at least if they are statically known to be subtypes of `Numeral`.<p>Naming variables with their units doesn&#x27;t solve the issue of mis-casting and using units incorrectly, and newtypes are too inconvenient (and sometimes impossible without affecting performance) so nobody uses them. Even as a very software-focused programmer I encounter units like seconds, bytes, pixels, etc. all the time, they are almost never newtypes, and I get bugs from forgetting to convert or converting incorrectly.","time":1647839358,"type":"comment"},{"by":"Closi","id":30751670,"kids":[30752111,30754144,30758271,30753080],"parent":30749134,"text":"I used to work at a company with two database fields, speed_kmph.<p>The documentation read &quot;speed_kmph - This field contains the travelling speed in MILES PER HOUR - please do not be confused by the name&quot;.<p>Woo, great job guys.","time":1647851586,"type":"comment"},{"by":"jillesvangurp","id":30751865,"kids":[30755993,30759764],"parent":30749134,"text":"Java and Kotlin have a nice Duration class. So in Kotlin you can do<p><pre><code>  delay(duration = Duration.ofMinutes(minutes = 1))\n</code></pre>\nwhich is equivalent to<p><pre><code>  delay(timeMillis = 60_000)\n</code></pre>\nUsing the optional argument names here for clarity; you don&#x27;t have to of course.<p>Sticking with the JVM, a frequent source of confusion is the epoch. Is it in millis or in seconds? With 32 bit integers that has to be seconds (which will set you up for the year 2038 problem). However, Java always used 64 bit longs for tracking the epoch in milliseconds instead even before the year 2000 problem was still a thing. Knowing which you are dealing with is kind of relevant in a lot of places; especially when interfacing with code or APIs written in other languages with more 32 bit legacy.<p>Things like network timeouts are usually in milliseconds. But how do you know this for sure? Specifying, them in seconds means that there&#x27;s less risk of forgetting a 0 or something like that. So, using seconds is pretty common too. You can&#x27;t just blindly assume one or the other. Even if you use the Duration class above, you&#x27;d still want to put the magic number it takes as a parameter in some configuration property or constant. Those need good names too and they should include the unit.","time":1647853618,"type":"comment"},{"by":"wodenokoto","id":30751469,"kids":[30752115,30751570,30752833,30751490,30751543],"parent":30749134,"text":"<p><pre><code>    timeout = timedelta(seconds=300)\n    frobnicate(timeout)\n</code></pre>\nWorking with GCP or Azure&#x27;s Python SDK is like navigating a jungle of types. Some calls return a `compute_engine_list_item` while others return a `compute_engine` type and these are difficult to inspect and reason about, because Python classes default to printing something along the lines of `&lt;__main__.myclass at 0x7fa8864a1040&gt;`, making heavily typed Python code quite difficult to work with.<p>No paradigm is going to save you from spaghetti-code, but being able to pass a list and get an integer in return, makes it very easy to reason about what you can do with these values, whereas it can be quite difficult to reason about custom types&#x2F;objects.<p>My point is, that knowing if `frobnicate(timeout=300)` is in seconds or minutes can be just as difficult (or even more difficult) as knowing what specific object I need to instantiate and pass to `frobnicate` (in the above case a `timedelta`)","time":1647849590,"type":"comment"},{"by":"logbiscuitswave","id":30750896,"kids":[30772136,30754122],"parent":30749134,"text":"Fully agree with everything in this article. This is definitely a code smell to me to see unitless sizes and intervals specified. I know that whenever I’m doing a code review and I see some property or variable name like “timeout” or “size” I will ask the developer to change the name to make it clear what the unit is trying to portray.<p>When possible, I also encourage the use of better types than simple integer values, (like TimeSpan if .NET) as these further reduce ambiguity and the potential for mistakes.<p>This is such a simple thing to find and fix but it definitely helps in the long term.","time":1647844087,"type":"comment"},{"by":"wyldfire","id":30749960,"kids":[30750018,30752170,30750974,30750290,30750161,30751323,30753987,30752075,30750662,30752627,30753176,30754817,30754822,30752045,30757240,30752026,30752069,30751424,30752083,30758138,30752803,30751975,30751775],"parent":30749134,"text":"I would go one step further and suggest that all physical quantities should either have the units in the identifier name or encoded in the type system.  Meters, seconds, milliamps, bytes, blocks, sectors, pages, rpm, kPa, etc.  Also it&#x27;s often useful to explicitly distinguish between different unit qualifications or references.  Seconds (duration) versus seconds-since-epoch, for example.  Bytes versus page-aligned bytes, for another.<p>Having everything work this way makes it so much easier to review code for errors.  Without this means that as a reviewer you must either trust that the units and conversions are correct or you should do some spelunking to make sure that the inputs and outputs are all in the right units.","time":1647834120,"type":"comment"},{"by":"alexwennerberg","id":30749652,"kids":[30749921,30749837,30752046,30749772,30749791,30749800,30750665,30750170,30749685,30749739,30749835],"parent":30749134,"text":"I think Go has a reasonable approach:<p><pre><code>  time.Sleep(1 * time.Second)</code></pre>","time":1647831468,"type":"comment"},{"by":"athenot","id":30753589,"kids":[30759389],"parent":30749134,"text":"And if you&#x27;re working with an existing system that doesn&#x27;t accomodate the suggested options, a well placed comment can go a long way. Provide the unit as well as WHY that value exists.<p><pre><code>    # Session inactivity, in seconds\n    time.sleep(300)\n\n    # Prevent pileup of unprocessable requests, in seconds\n    request_timeout = 10</code></pre>","time":1647867626,"type":"comment"},{"by":"rpaddock","id":30757858,"kids":[30759734],"parent":30749134,"text":"I once went in to clean up a project that was designed by a committee of people spread all over the world. The unit was large moving equipment that if something went wrong, people might die. The unit was composed of several different CPU modules communicating on a property bus. Each module&#x27;s software was written by a different group in a different part of the world.<p>The operator&#x27;s requested speed was input in Feet Per Minute. The output to a Variable Frequency Drive was in tenths of Hertz. The tachometer feedback was in RPM, and to top it off all the internal calculations were done in Radians-Per-Second.<p>The first thing I did to get the project back on track was to adopt a standardized variable naming convention that included the units. For example the Operator Request became operator_request_fpm_u16. You then knew immediately you were dealing with Feet Per Minutes, and that it was a 16 bit unsigned variable.<p>After the variable name cleanup many of the bugs became self documented, when you saw something like &quot;operator_request_fpm_u16 &#x2F; vfd_hz_s32&quot; in the code, you knew there was a problem that needed to be fixed...","time":1647887364,"type":"comment"},{"by":"josephg","id":30749602,"kids":[30749804,30749650,30749648],"parent":30749134,"text":"One more tip: If you&#x27;re ever designing an API like this, instead of:<p>time.sleep(300)<p>Put your units in the method name:<p>time.sleep_seconds(300)<p>Likewise, if you&#x27;re making a .length() method where the units are at all ambiguous (like the length of a string), name your units. Bad: str.len(). Good: str.len_chars() &#x2F; str.len_utf8_bytes(). (I&#x27;m looking at you, Rust!)","time":1647831194,"type":"comment"},{"by":"dmurray","id":30752003,"kids":[30754380,30753119,30752428],"parent":30749134,"text":"Next step, please don&#x27;t call your variables ..._percent but interpret 0.5 as meaning 50% of the reference value.","time":1647854935,"type":"comment"},{"by":"emmelaich","id":30750105,"kids":[30750478],"parent":30749134,"text":"Worth mentioning Frink.<p>&gt; <i>Frink is a practical calculating tool and programming language designed to make physical calculations simple, to help ensure that answers come out right, and to make a tool that&#x27;s really useful in the real world. It tracks units of measure (feet, meters, kilograms, watts, etc.) through all calculations..</i><p><a href=\"https:&#x2F;&#x2F;frinklang.org&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;frinklang.org&#x2F;</a>","time":1647835377,"type":"comment"},{"by":"hmaarrfk","id":30749998,"kids":[30750082,30750689,30750123,30750025,30752865,30750320,30752354,30750054],"parent":30749134,"text":"I typically stick to &quot;SI&quot; units.<p>Then, somebody asks me to code in the temperature of a system. And I have to think: &quot;Is now really the time that I want to teach people the difference a kelvins and celsius?&quot;<p>So my rule becomes, SI &quot;except&quot; temperature. Sigh...","time":1647834491,"type":"comment"},{"by":"swyx","id":30749934,"kids":[30773882,30750108],"parent":30749134,"text":"in the genre of naming things, some related things to explore:<p>- avoiding naming things if you can help it<p>- using tooling to autogenerate names<p>- avoiding too short, likely overloaded names like `id`, `name`, and `url`<p>- don&#x27;t choose lazy pluralization - eg instead of `names&#x2F;name`, use `nameList&#x2F;nameItem`<p>- encoding types to make Wrong Code Look Wrong, a famous Spolsky opinion (lite hungarian notation)<p>- coming up with grammars for naming, eg React had an exercise to name its lifecycles combinations of THING-VERB-ACTION, like `componentDidMount`, before open sourcing, which helped learnability<p>pulled from my collection of Naming Opinions here: <a href=\"https:&#x2F;&#x2F;www.swyx.io&#x2F;how-to-name-things\" rel=\"nofollow\">https:&#x2F;&#x2F;www.swyx.io&#x2F;how-to-name-things</a>","time":1647833874,"type":"comment"},{"by":"xyzzy_plugh","id":30749697,"kids":[30749790,30750095,30749811],"parent":30749134,"text":"Or join the ranks of your peers who have seen the light and use types.<p>Documentation should always be secondary to an obvious, descriptive interface. We&#x27;ve evolved beyond register positions and phonebook-style paper documentation. Use the tools available to you.","time":1647831724,"type":"comment"},{"by":"yummybear","id":30751080,"kids":[30751807,30751203,30752445,30751468,30751246],"parent":30749134,"text":"I can understand the reasoning, in this specific case. But having every function designating their unit is a new hungarian notation. Imagine working with:<p>setSpeedInKilometersPerSecond vs. setSpeed<p>I&#x27;d rather have it baked into the language ala CSS (&quot;100ms&quot;).","time":1647846280,"type":"comment"},{"by":"james2doyle","id":30756005,"kids":[30756203,30756172],"parent":30749134,"text":"If you&#x27;re using Javascript or Typescript, there is an Eslint rule called &quot;no-magic-numbers&quot; which enforces a rule where numbers are required to be assigned to a variable: <a href=\"https:&#x2F;&#x2F;eslint.org&#x2F;docs&#x2F;rules&#x2F;no-magic-numbers\" rel=\"nofollow\">https:&#x2F;&#x2F;eslint.org&#x2F;docs&#x2F;rules&#x2F;no-magic-numbers</a><p>You can set ones to ignore, a minimum value for the rule to apply, or require the variable to be a const.","time":1647879999,"type":"comment"},{"by":"rubenbe","id":30751037,"parent":30749134,"text":"For C++ you can use boost units. It is basically built up of template magic which only compiles when your units are correct.\nThe disadvantage: when it doesn&#x27;t, it explodes in a huge template error. But when it does, you can be pretty certain (depending on the actual calculation) that your code is correct. It is also fully verified at compile time, so there is no runtime overhead.<p><a href=\"https:&#x2F;&#x2F;www.boost.org&#x2F;doc&#x2F;libs&#x2F;1_78_0&#x2F;doc&#x2F;html&#x2F;boost_units.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.boost.org&#x2F;doc&#x2F;libs&#x2F;1_78_0&#x2F;doc&#x2F;html&#x2F;boost_units.h...</a>","time":1647845748,"type":"comment"},{"by":"btown","id":30750317,"kids":[30750717,30751940],"parent":30749134,"text":"Along these lines: if you are designing an API for pricing data or fintech and think “let’s send things in integer cents of the currency so there aren’t any rounding errors” - setting aside that there are many situations where this is not appropriate, if you do still want to do this, for the love of Pete please name your variables and attributes with `_cents` in the names. No exceptions. It is the biggest unit-related footgun imaginable, and since it’s not a “unit” technically, it’s easy to overlook.","time":1647837287,"type":"comment"},{"by":"rolobio","id":30750134,"kids":[30750584],"parent":30749134,"text":"In Python you can force the use of a parameter’s name with *<p><pre><code>  def my_sleep(*, seconds: int):\n     pass\n\n  my_sleep(seconds=3)\n</code></pre>\nThis will force those who use your function to use the parameter name. A sort of documentation I suppose.","time":1647835660,"type":"comment"},{"by":"segphault","id":30748070,"kids":[30752635,30748189,30748194,30750145,30748184,30753586,30748226,30751934,30750461,30749022,30748543,30750106,30748876,30751548,30758195,30758532,30753498,30748362,30752462,30749455,30760906,30751412,30752813,30751489],"parent":30747332,"text":"Like every Windows user, I have had a lot of frustrating experiences with the abusive behavior and dark patterns that have taken over the platform. Like when they started having Skype silently run in the background logged in with the user&#x27;s Microsoft account without any notice or human intervention, and removed the setting to disable it from launching at startup so that it couldn&#x27;t be prevented. I had to completely uninstall it, which didn&#x27;t really help, because they still kept bringing it back after every update. I assume that they&#x27;re going to do this with Teams now.<p>For every egregious user-hostile behavior, you can search and find a ton of forum threads where people discuss at length how to reverse or mitigate them. The fact that Microsoft is aware of this and continues to prioritize this kind of abusive growth hacking over user trust, knowing fully how that impacts the company&#x27;s reputation among enthusiasts, is perhaps more damning than the actual practices.<p>Nobody at Microsoft who has decision-making authority actually cares. Contempt for the users is so deep in the DNA that this will never get better. It&#x27;s disappointing, because it ultimately undermines all of the great effort that people elsewhere in the company have put into features like WSL that might otherwise make the platform attractive to modern developers.<p>It creates a really adversarial posture between the user and the platform. When they introduce new features, I&#x27;m reluctant to even try them because I don&#x27;t trust their intentions. It&#x27;s like being in an abusive relationship.","time":1647820102,"type":"comment"},{"by":"khaledh","id":30748076,"kids":[30748166,30748108,30752025,30749050,30750275],"parent":30747332,"text":"This article nails a lot of the issues with Windows 11.<p>I bit the bullet and upgraded to Windows 11 late last year thinking it must be an improvement over Windows 10. It turned out to be a big step backwards.<p>- Changing the default browser is a lot of work instead of a single click.<p>- I can&#x27;t move the task bar to the side, even though almost every monitor nowadays has much more horizontal space than vertical.<p>- All apps are not readily accessible from the start menu; I have to click another button to get to them.<p>- I have a 2-in-1 laptop, and turning it into tablet mode is wonky.<p>- I can&#x27;t choose to not have grouped buttons on the taskbar.<p>- The context menus UX is horrible. Some context menu items are now two clicks away instead of one. Also what&#x27;s with the excessive rounded corners and slim selection padding?<p>- The stacked notifications is confusing, and always shows the calendar when I open the notifications panel.<p>- Lots of crap pushed on me, like chat (aka Teams), widgets (which require a Microsoft account), 3rd party apps that look like they&#x27;re installed but actually get downloaded&#x2F;installed on first use.<p>I was able to fix a lot of those issues with ExplorerPatcher [0]. However, one day after a Windows update, Explorer didn&#x27;t start at all after login (black screen, I thought Windows was hosed). This has since been fixed. But I decided enough is enough, and finally &quot;upgraded&quot; back to Windows 10.<p>The only good thing about Windows 11 is wslg, which provides out of the box support for Linux GUI apps (not available on Windows 10). But I can get the same result with an X server and some work.<p>[0] <a href=\"https:&#x2F;&#x2F;github.com&#x2F;valinet&#x2F;ExplorerPatcher&#x2F;wiki&#x2F;All-features\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;valinet&#x2F;ExplorerPatcher&#x2F;wiki&#x2F;All-features</a>","time":1647820137,"type":"comment"},{"by":"userbinator","id":30748284,"kids":[30749278,30748975,30750155,30748402],"parent":30747332,"text":"<i>This menu is familiar to me because that’s what the Windows API allows you to create (as long as you are not creating it through Windows Forms.) There is no dark theme for this, but at least there are rounded corners.</i><p>That is just a huge WTF. Since the very earliest versions of Windows there has always been the option of a dark (or white, or rainbow, or ...) theme, where you could adjust the colours and sizes and fonts, and everything using Win32 would follow it. Here&#x27;s Win95 example:<p><a href=\"https:&#x2F;&#x2F;64.media.tumblr.com&#x2F;6d3e8c64cd9a38e70d24c0b1b2c73cb5&#x2F;tumblr_mwjaieyign1t2as4so6_1280.png\" rel=\"nofollow\">https:&#x2F;&#x2F;64.media.tumblr.com&#x2F;6d3e8c64cd9a38e70d24c0b1b2c73cb5...</a><p>Yet if I&#x27;m understanding correctly, in Win11 that stopped working completely? It really sounds like the Windows team has no one left who knows what used to be possible but isn&#x27;t anymore, being replaced with probably younger developers making constant excuses to &quot;modernise&quot; by rewriting and breaking stuff. To use an analogy, they&#x27;re not just reinventing the wheel but making it square.","time":1647821535,"type":"comment"},{"by":"seanp2k2","id":30749504,"kids":[30757318,30751687],"parent":30747332,"text":"I don&#x27;t see any mention of Cortana or how hard that is to rip out of the OS, but I think it&#x27;s worth mentioning. The tool called &quot;Everything&quot; by <a href=\"https:&#x2F;&#x2F;www.voidtools.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.voidtools.com&#x2F;</a> is so insanely better than Cortana and blazingly fast that I&#x27;m not sure why they&#x27;re still trying to push Cortana.<p><a href=\"https:&#x2F;&#x2F;www.getblackbird.net&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.getblackbird.net&#x2F;</a> helps a lot and it&#x27;s one of the first things I do to Windows installs when I need to use them, but it can break stuff if you&#x27;re too aggressive with it (e.g. Windows store &#x2F; Xbox stuff, which for some reason is how to record screenshot videos in Windows... <a href=\"https:&#x2F;&#x2F;support.microsoft.com&#x2F;en-us&#x2F;windows&#x2F;record-a-game-clip-on-your-pc-with-xbox-game-bar-2f477001-54d4-1276-9144-b0416a307f3c\" rel=\"nofollow\">https:&#x2F;&#x2F;support.microsoft.com&#x2F;en-us&#x2F;windows&#x2F;record-a-game-cl...</a> ).<p>The article also didn&#x27;t mention the Microsoft Store and how awful everything around that experience is, especially compared to macOS, where the worst part is how signing apps works ( <a href=\"https:&#x2F;&#x2F;developer.apple.com&#x2F;library&#x2F;archive&#x2F;documentation&#x2F;Security&#x2F;Conceptual&#x2F;CodeSigningGuide&#x2F;Introduction&#x2F;Introduction.html#&#x2F;&#x2F;apple_ref&#x2F;doc&#x2F;uid&#x2F;TP40005929-CH1-SW1\" rel=\"nofollow\">https:&#x2F;&#x2F;developer.apple.com&#x2F;library&#x2F;archive&#x2F;documentation&#x2F;Se...</a>  vs <a href=\"https:&#x2F;&#x2F;docs.microsoft.com&#x2F;en-us&#x2F;windows&#x2F;msix&#x2F;package&#x2F;signing-package-overview\" rel=\"nofollow\">https:&#x2F;&#x2F;docs.microsoft.com&#x2F;en-us&#x2F;windows&#x2F;msix&#x2F;package&#x2F;signin...</a> ).","time":1647830442,"type":"comment"},{"by":"vstollen","id":30748273,"kids":[30748334,30752128,30755036],"parent":30747332,"text":"It&#x27;s mind boggling how user-hostile one can make a piece of &quot;premium&quot; software.<p>You pay 145€ for the Home or 259€ for the Pro Edition and they treat it like it&#x27;s freeware.<p>I want my computer to support me in achieving what I want to do, but Windows just keeps grabbing attention with intrusive ads and never-ending notifications.","time":1647821451,"type":"comment"},{"by":"anon1900","id":30748110,"kids":[30748612,30748516,30748354,30750401],"parent":30747332,"text":"As an engineer working at Microsoft in Windows, I 100% agree...it&#x27;s just as frustrating seeing these from inside as well<p>(edit: from throwaway as a protective measure)","time":1647820390,"type":"comment"},{"by":"pie_flavor","id":30754842,"kids":[30763487,30756511],"parent":30747332,"text":"I am the most ardent Windows evangelist I know. I have spent so much time learning Windows&#x27;s APIs and idiosyncrasies because they&#x27;re just so cool. I love the APIs, I love the system, I love the software and I love the way everything Just Works.<p>And I&#x27;m not installing this shit. It&#x27;s a skin. It&#x27;s Windows 10, but retvrned to rounded corners, and with a <i>tenth</i> of the customizability. It&#x27;s an attempt to put Mac in Windows by people who don&#x27;t understand either and, if previous HN threads are true, who don&#x27;t dogfood the result. It has no serious improvements at any level, and every change they have made at first glance is a step backwards. WinUI 3 is already in Win10 and the Android emulator will be ported when it actually comes out. And most damning, I hear report after report after report of backcompat issues with games, which is supposed to be Windows&#x27;s <i>flagship</i> feature. So what&#x27;s the point of upgrading? Why would I ever? It&#x27;s like Windows 8 all over again, but this time they&#x27;re not even replacing old stuff with new stuff, they&#x27;re just fucking up the old stuff.","time":1647874614,"type":"comment"},{"by":"sylens","id":30747863,"kids":[30747986,30748201],"parent":30747332,"text":"This post resonates with me a lot, as I share many of the same complaints. The UI inconsistencies are one thing (that you would hope get ironed out over time), but the level of ads creeping ever higher is alarming. The “accidental” inclusion of an ad in Windows Explorer this week may have tipped their hand - if that’s the direction they are going, I’m moving off the platform entirely.","time":1647818553,"type":"comment"},{"by":"fmakunbound","id":30749019,"kids":[30750023],"parent":30747332,"text":"What you’re seeing there in Windows is a two-dimensional, stylized representation of the bloody turf battles between business units within Microsoft. Most recently adtech has entered the battle and seem to be really killing it.","time":1647826509,"type":"comment"},{"by":"worewood","id":30747926,"kids":[30748130,30748853,30748180,30751122,30748104,30749285,30755942,30748560],"parent":30747332,"text":"If they shipped a version of Windows sporting the Windows-11 kernel, so running all the recent software, but with Windows 2000 UI for a thousand dollars I would buy it immediately.","time":1647818968,"type":"comment"},{"by":"artificialLimbs","id":30748990,"kids":[30749310,30751038,30749445,30751085,30749298,30753723,30757053,30754158],"parent":30747332,"text":"I stopped playing Minecraft recently again. I first quit a few years ago, but wanted to show it to my young son. Trying to go back and EVEN JUST INSTALL it now is filled with Microsoft-ian circles of login catastrophe and &quot;upgrade your account&quot; nightmares.<p>The installation process was so difficult, I will never play again.","time":1647826269,"type":"comment"},{"by":"makecheck","id":30757281,"kids":[30760521],"parent":30747332,"text":"I feel like the industry is really struggling with shipping “boring utilitarian things”.  Rather than let software remain boring and just-plain-useful, it is forced to slowly transform into a nightmare of ads, pop-ups and other crap that is clearly NOT required for core functionality and ultimately the whole thing becomes awful to use.<p>Even when the intrusion is small, it is ridiculous because it is not required for the software to work (e.g. in the iPhone SETTINGS app, nothing about tweaking <i>settings</i> ever requires the user to view a stupid ad, and yet there they are, crappifying the UI).<p>And as I get older I am telling myself “this isn’t what I signed up for”: I want useful software that is free of garbage, <i>especially</i> when money is exchanged, and most <i>certainly</i> when a LOT of money is exchanged.<p>So tell these bean-counters to get the hell out, and let us make computers “only” useful instead of ad-spewing machines.","time":1647884534,"type":"comment"},{"by":"ryandrake","id":30749836,"kids":[30750321,30750124,30750138,30750340,30753079,30753085],"parent":30747332,"text":"There&#x27;s been a big shift in the whole software industry from &quot;enable what the user wants to do&quot; over to &quot;we want the user to do this&quot;. Back in the &#x27;90s, we would go out, talk to customers, find out their needs, gather requirements, and write software that enables them to do what they want to do. Now, in a lot of software companies, it&#x27;s the opposite. Product leadership starts with &quot;What do we want users to do?&quot; and then every software decision is in service of encouraging &#x2F; forcing &#x2F; channeling users&#x27; behavior into these paths. I&#x27;ve sat in product meetings where people would just say &quot;No, the user should not be allowed to do ABC, we (Company) need them to do XYZ!&quot; It&#x27;s arrogance, it&#x27;s hubris and it&#x27;s everywhere.<p>The slogan &quot;Where do you want to go today?&quot; is dead. It&#x27;s now all &quot;This is where we will let you go today!&quot;","time":1647832729,"type":"comment"},{"by":"Traster","id":30749257,"kids":[30750100],"parent":30747332,"text":"The problem I have with windows is two-fold. Firstly, I came to windows before Vista. So I know how powerful the old windows settings&#x2F;features were. I knew exactly where to access everything I wanted. I have a feeling this is probably the same for many people from all sorts of backgrounds (Personally, I experimented with Apple - Hello touchbar!). But the second issue is the new damn UIs aren&#x27;t exhasutive! THey&#x27;re a thin layer on top of the acutal data, which don&#x27;t tell you what you actually need, and often revert you back to the old UI. If you&#x27;re going to ship a product that refers me back to the old UI for half the stuff I&#x27;m interested in... just don&#x27;t ship the new UI. It&#x27;s not worth the time.<p>It&#x27;s been 15 years since Vista and this hasn&#x27;t been fixed. It&#x27;s difficult to find people to actually just deliver on basic stuff apparently. This is why the commandline works. Becuase if all else fails there is 1 interface. I don&#x27;t think this is unfixable but it requires a <i>lot</i> of gruntwork.","time":1647828603,"type":"comment"},{"by":"apatheticonion","id":30751544,"kids":[30751594,30751605,30751923,30754641],"parent":30747332,"text":"Kinda at a loss for OS&#x2F;DE at the moment.<p>Lived on Windows for over 2 decades (completed work via a Linux VM). Windows 8 was horrid and Windows 10&#x2F;11 is hostile towards user experience (etc, etc privacy, but mostly user experience).<p>Used MacOS for half a decade after that and loved the Unix terminal and tight desktop experience but underpowered and overpriced hardware had me running a hackintosh for over half of that time. The move to M1 (and general difficulty maintaining a Hackintosh) means that MacOS is off the table for me.<p>I am currently daily driving Gnome 4 on Fedora and loving it. It has some user application UX issues (like Google Chrome mouse scrolls slowly) and some questionable desktop environment design decisions - but overall a nice place to land.<p>Not quite as nice as MacOS but it gets the job done.<p>It&#x27;s sad that after 30 years on computers, my user experience has gotten worse - Gnome 4 came along at the perfect time to catch a bunch of MacOS and Windows refugees and I pray the developers push it in a direction where it becomes the most ergonomic desktop environment available on the Desktop - at least for engineers.","time":1647850367,"type":"comment"},{"by":"shp0ngle","id":30749363,"kids":[30750843,30750205,30749487,30760036,30754116,30750002,30749802,30749514,30751253],"parent":30747332,"text":"Well, what are you going to do. <i>Not</i> use Windows?<p>Linux still barely works in 2022 (and if one distro will become really popular, with a big investment of money like Ubuntu did once, they will ad ads, like Ubuntu added Amazon), and MacOS works just on Apple HW (and has ads for Apple services baked-in too, just less obnoxious).<p>You can use ChromeOS! Which is literally ad tech.<p>Pick your poison.","time":1647829439,"type":"comment"},{"by":"neltnerb","id":30748995,"parent":30747332,"text":"I&#x27;ve been using Linux for 21 years. I currently have to deal with maintaining specialty software for 50+ computers.<p>From everything I&#x27;ve seen I dread upgrading to Windows 11 only slightly less than just figuring out how to convert it all to work on Linux somehow. I imagine like everyone I will put it off until the last possible second.<p>No need to reply about how you can do everything on Linux now, until wine works perfectly with $100k equipment that only works with Windows software from 2004 100% of the time it&#x27;s too risky ;-)<p>The point is that I understand how much of a pain it would be to convert to using Linux and still think it could potentially be worth it compared to upgrading to Windows 11. I would never consider it at all if it was just an OS instead of an experience... what are the odds that the software works on Windows 11 perfectly anyway, my experience going from Windows 7 to Windows 10 was pretty miserable and that was 3 years after Windows 10 was standard.","time":1647826313,"type":"comment"},{"by":"phkahler","id":30753622,"kids":[30754656,30757438,30754273,30756664,30770167],"parent":30747332,"text":"Windows <i>users</i> need a change in priorities. FTFY.<p>The OS has gone to shit, but people keep right on using it and complaining about how bad it&#x27;s getting. What is your lame priority for sticking with it? Don&#x27;t tell me gaming - get a console or VR headset, or steam on Linux. If you&#x27;re that hung up on <i>one</i> game that doesn&#x27;t run anywhere else then again you need to change your priorities. If it&#x27;s using Excel or Word with a bunch of customizations that won&#x27;t work in LibreOffice, again you need to change your priorities or approach to solving the problems you did that to solve.","time":1647867819,"type":"comment"},{"by":"Royi","id":30748052,"kids":[30748067,30748648,30748291,30748075,30752092],"parent":30747332,"text":"The only direction Windows should go is being more modular and less features.  \nSpeed is probably the only feature all users want.<p>So make all features modular with advanced user being able to remove and get a lean and mean OS.<p>We want less, we want speed.<p>P. S.\nIt is about time to upgrade the File System. It is too slow...","time":1647819958,"type":"comment"},{"by":"lucasyvas","id":30748115,"kids":[30748628,30748717,30748171],"parent":30747332,"text":"These problems tend to work themselves out naturally - when you purposefully damage your user experience, you lose the early tech adopters that originally drove your product growth. They instead flock to a competitor that leaves you holding your bag of a shitty product.<p>There are a few companies flirting with this dangerous line right now and it opens them up completely for disruption, which is the opposite of what they want.","time":1647820424,"type":"comment"},{"by":"MontagFTB","id":30730643,"kids":[30731229,30732671,30731218,30731192,30733855,30731317,30731596],"parent":30729109,"text":"I really appreciate how NASA is handling the James Webb. Instead of waiting for everything to be _done_ done, they’re bringing us all along for the setup, giving us “alpha” and “beta” images (if you will), and in so doing keeping interest in the telescope. I know it’ll continue, and I’m all hype about it.","time":1647660058,"type":"comment"},{"by":"mysterypie","id":30731632,"kids":[30737627,30733898,30732868,30733083,30745314,30737665,30732320,30732410,30732201],"parent":30729109,"text":"I was wondering why the star has 6 crisp points and found an explanation here (a 3 minute video):<p><a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=VVAKFJ8VVp4\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=VVAKFJ8VVp4</a><p>The most interesting part of the video explains why even your naked eye viewing the sky at night will cause this effect -- it&#x27;s due to imperfections in the lens of your eye.","time":1647671014,"type":"comment"},{"by":"deathanatos","id":30730500,"kids":[30730654,30735921],"parent":30729109,"text":"The NASA press release, which includes the same photo but at a decent resolution: <a href=\"https:&#x2F;&#x2F;www.nasa.gov&#x2F;press-release&#x2F;nasa-s-webb-reaches-alignment-milestone-optics-working-successfully\" rel=\"nofollow\">https:&#x2F;&#x2F;www.nasa.gov&#x2F;press-release&#x2F;nasa-s-webb-reaches-align...</a>","time":1647658530,"type":"comment"},{"by":"JKCalhoun","id":30730897,"kids":[30731011,30731814,30731299,30731402,30730971,30732424,30731215,30735183,30737400,30733309,30731150,30736552,30732380,30733594,30731838],"parent":30729109,"text":"Considering these &#x27;deep space&#x27; images that capture these myriad of little galaxies so far away.... The number of galaxies that must be out there is inconceivable to me.<p>Spitballing.<p>Might there be some space&#x2F;time mechanism at play whereby we&#x27;re actually seeing the same handful or so of galaxies? Like maybe some lensing thing.<p>Or weirder, we&#x27;re actually seeing right around the universe itself — as though seeing the back of your head in a mirror if you look far enough. Not a topologist, but seems a toroidal universe would have a property like this: look far enough and you see the back of your head. So perhaps the same galaxies seen from multiple angles at the same time appear to be a greater number of galaxies than there actually are.","time":1647662845,"type":"comment"},{"by":"baggy_trough","id":30730790,"parent":30729109,"text":"Comparison with the previous generation infrared telescope, showing the massive increase in resolution.<p><a href=\"https:&#x2F;&#x2F;twitter.com&#x2F;gbrammer&#x2F;status&#x2F;1504369779540480002\" rel=\"nofollow\">https:&#x2F;&#x2F;twitter.com&#x2F;gbrammer&#x2F;status&#x2F;1504369779540480002</a>","time":1647661647,"type":"comment"},{"by":"zamalek","id":30730803,"kids":[30731047,30730907,30731210],"parent":30729109,"text":"I am so relieved that it made it without hitting some debris, and that the hydraulics didn&#x27;t fail for the unfurling. The unfurling was one insane piece of orchestration, which just means many more opportunities to see a piece of space dust or something messing it all up.<p>This image is fantastic, even though we can easily see that more work needs to be done with the alignment. It hopefully proves that alignment is all that&#x27;s left.","time":1647661761,"type":"comment"},{"by":"sizzzzlerz","id":30729211,"parent":30729109,"text":"A universe of kudos to NASA, Goddard, and the hundreds, maybe thousands, of scientists, engineers, and technicians who designed, built, tested, launched, and now, run, this jewel. This is just the beginning.","time":1647647753,"type":"comment"},{"by":"blenderdt","id":30732283,"kids":[30732483],"parent":30729109,"text":"Here a nice video that explains the mechanism that aligns each mirror:<p><a href=\"https:&#x2F;&#x2F;youtu.be&#x2F;5MxH1sfJLBQ\" rel=\"nofollow\">https:&#x2F;&#x2F;youtu.be&#x2F;5MxH1sfJLBQ</a><p>It is amazing that this is done with only a single motor.<p>It works something like this: one direction of the motor sets which axis to align, the other direction sets the alignment of the chosen axis.","time":1647680471,"type":"comment"},{"by":"Gatsky","id":30731919,"kids":[30742495],"parent":30729109,"text":"I wonder if this thing will see something which changes the course of human civilisation...","time":1647675083,"type":"comment"},{"by":"ffhhj","id":30731106,"kids":[30731378,30731648,30731147,30731178,30732000],"parent":30729109,"text":"Which are your most expected objects that Webb should photograph? Here is my list:<p>1- M60 blackhole<p>2- Proxima Centauri b<p>3- Tabby&#x27;s Star<p>4- some apparently empty space<p>5- Mars surface<p>6- Sagittarius A*<p>7- Mercury&#x27;s craters with water","time":1647664946,"type":"comment"},{"by":"idontwantthis","id":30730529,"kids":[30731145,30730838,30730710,30731631,30731409],"parent":30729109,"text":"Have you seen any articles on what was learned in the design and manufacturing and if NASA believes that similar cost and time overruns can be avoided on follow ups?<p>Really curious if $10 Billion is just what it actually costs to build this incredible machine, or if the pioneering work will mean that we can do a better job making things like it now.","time":1647658808,"type":"comment"},{"by":"sddat","id":30733025,"kids":[30733812,30740408],"parent":30729109,"text":"Is technology like the webb telescope design , or curiosity design open and public ? I mean eg CAD , components used , other details ?","time":1647690432,"type":"comment"},{"by":"mensetmanusman","id":30733312,"kids":[30733664],"parent":30729109,"text":"In the Copenhagen interpretation of QM did James Webb collapse these distant galaxies because they were finally measured? :)","time":1647693881,"type":"comment"},{"by":"vgchh","id":30735071,"parent":30729109,"text":"A bit poetic, but suddenly the universe feels a bit more approachable, more within reach, a bit more sane. As if, through JWST, you can extend your hand and touch and feel and socialize with neighboring galaxies. Truly a window to our galactic neighbors.","time":1647707180,"type":"comment"},{"by":"gorgoiler","id":30731589,"kids":[30731783],"parent":30729109,"text":"This is the first time we’ve imaged these galaxies.  Did we know they were there?","time":1647670531,"type":"comment"},{"deleted":true,"id":30733890,"parent":30729109,"time":1647699477,"type":"comment"},{"by":"quantified","id":30730389,"kids":[30730497,30730787,30731717,30731084],"parent":30729109,"text":"Between James Webb and Ingenuity, major kudos to things that actually work. Can’t take any of these successes for granted, even if we spend $100 billion (!) on just one of them. Hope Webb is safe in its Lagrange point for a long life. Glad we actually had built the 100B of wealth to deploy.<p>Now if we can only get those $800MM  littoral combat ships to work, we’re building like 53 of them and they don’t launch up, they launch down a few feet. Not rocket science…","time":1647657475,"type":"comment"},{"by":"themeiguoren","id":30737619,"parent":30729109,"text":"What were the expectations and what are they measuring that exceeds that? I haven’t seen any comparison of the metrics. From my memory, the JWST was roughly a 10x upgrade relative to Hubble in each of spectral resolution, angular resolution, and platform stability. How are those numbers looking now?","time":1647724330,"type":"comment"},{"by":"pmoriarty","id":30742328,"kids":[30742366],"parent":30729109,"text":"Since the James Webb telescope primarily operates in the infrared, does that mean we can&#x27;t expect magnificently colored images from it of the kind we got from the Hubble telescope?","time":1647781808,"type":"comment"},{"by":"ck2","id":30732751,"parent":30729109,"text":"The endless dots as entire galaxies in that photo is just beyond mind-blowing.<p>I wonder if the public can really grasp it, not just grains of sands on a beach but each one a beach with 100-MILLION grains of sand.<p>If we can&#x27;t have FTL travel in my lifetime sure would be nice if they figure out FTL communication.","time":1647686844,"type":"comment"},{"by":"imgabe","id":30748562,"kids":[30749140,30748909,30749069,30750306,30749554,30749052,30748630,30748956,30751234,30750873,30752692,30749441,30750042,30748967,30751474,30748894,30749109,30753129,30749855,30757274,30749340,30749356,30755920,30754095,30754224,30756672,30750469,30756954,30751422,30748953,30748780,30749128],"parent":30744925,"text":"Higher education in the US is trying to fulfill so many roles it&#x27;s unsustainable.<p><pre><code>    - teaching marketable skills so people can get jobs\n    - teaching &quot;how to think&quot; and learning about art and culture\n    - Performing cutting edge research\n    - minor league sports teams\n</code></pre>\nThe large state schools are trying to fulfill all these conflicting roles. We should probably break them out to separate entities.<p>If you have a physicist who&#x27;s at the leading edge of research in their field, you want them doing that research, not teaching 18 year old&#x27;s Newton&#x27;s laws of motion. And they&#x27;re mostly not doing that teaching, that gets farmed out to an adjunct paid starvation wages. So the kid who&#x27;s paying through the nose to attend a top university with the best researchers doesn&#x27;t get to interact with them much and gets an inferior education compared to one where they hired and properly compensated someone to actually focus on teaching.<p>If we want to train people for specific jobs - create institutions that do that. If the upper class want someplace to send their kids to read poetry and binge drink for 4 years before they get a jr. associate position at their Dad&#x27;s investment bank, create a separate institution for that. Major league sports should create and manage their own feeder leagues to develop players, no reason to cram that into a university. We should create dedicated research institutions so researchers don&#x27;t have to pretend to care about teaching.","time":1647823080,"type":"comment"},{"by":"WoodenChair","id":30750254,"kids":[30751152,30750412,30750471,30750544,30750494,30751257,30768565,30750998,30750686,30752240,30750764,30750357],"parent":30744925,"text":"Sam Altman makes a lot of grandiose predictions and statements.<p>For example, in 2019 he said “Human radiologists are already much worse than computer radiologists. If I had to pick a human or an AI to read my scan, I’d pick the AI.” [0] However, most people with domain knowledge in this space still would not want their scan not to be read by a human. The AI radiology apps are generally narrowly focused and useful for consultation not diagnosis. [1]<p>In 2015 he predicted: “Self-driving cars are going to get here much faster than people think,” Altman said. He thought we’d see them in three to four years. [2]<p>I think he would be wise to learn from Bill Gates that it&#x27;s a bad idea to over-predict what will happen in the short term. &quot;We always overestimate the change that will occur in the next two years and underestimate the change that will occur in the next ten.&quot;<p>I&#x27;ll add to this that it&#x27;s generally a bad idea to make big predictions outside of areas that you have strong domain knowledge in. I doubt Sam Altman has strong domain knowledge around US higher education. Unfortunately, Silicon Valley culture is full of people who feel that because they&#x27;ve succeeded in one domain they have some kind of hidden insight into others.<p>[0] <a href=\"https:&#x2F;&#x2F;www.cnbc.com&#x2F;2019&#x2F;02&#x2F;26&#x2F;sam-altman-on-ai-jobs-may-go-away-but-massive-abundance-likely.html\" rel=\"nofollow\">https:&#x2F;&#x2F;www.cnbc.com&#x2F;2019&#x2F;02&#x2F;26&#x2F;sam-altman-on-ai-jobs-may-go...</a><p>[1] <a href=\"https:&#x2F;&#x2F;link.springer.com&#x2F;article&#x2F;10.1007&#x2F;s00330-020-07230-9\" rel=\"nofollow\">https:&#x2F;&#x2F;link.springer.com&#x2F;article&#x2F;10.1007&#x2F;s00330-020-07230-9</a><p>[2] <a href=\"https:&#x2F;&#x2F;techcrunch.com&#x2F;2015&#x2F;10&#x2F;06&#x2F;elon-musk-sam-altman-say-self-driving-cars-are-going-to-be-on-the-road-in-just-a-few-years&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;techcrunch.com&#x2F;2015&#x2F;10&#x2F;06&#x2F;elon-musk-sam-altman-say-s...</a>","time":1647836795,"type":"comment"},{"by":"throwawaycities","id":30749283,"kids":[30751804,30751435,30749915,30749556,30754606,30749540,30754265,30764143],"parent":30744925,"text":"I think the writing on the wall is clear regarding student loans.<p>The entire notion of taxpayer funded student loans is a scam on both taxpayers and students.  It’s a system that allows the colleges&#x2F;universities to charge any tuition they want and guarantees there will be an artificial demand.<p>For about a decade at least 1M student loan holders default per year. Long before the defaults reached that high, everyone involved knew that student loans were far outpacing the economic value, and yet not a single college or university stepped up in goodfaith to blow the whistle, they continued to suckle at the tit to the detriment of their own students.<p>Education is supposed to benefit students and the nation as a whole but the ridiculousness of loans has ensured it ruins lives and at &gt;$1.5T in taxpayer funded debt that continues to grow exponentially it is a detriment to the country.<p>Collapse of student loans will of course have an impact of the college&#x2F;university landscape, but the industry as a whole will not collapse, rather tuition will “collapse”, or come down, to what students can actually afford out of pocket without going into debt.  And if the universities&#x2F;colleges somehow can’t survive on existing taxpayers subsidies from the Dept. of Educations $68B annual budget plus out of pocket tuition rates, then welcome to the real world your university&#x2F;college is a failed business.","time":1647828890,"type":"comment"},{"by":"mind-blight","id":30745769,"kids":[30747939,30748232,30747824,30748756,30746183,30747771,30746111,30748078,30749378,30748499,30748357,30751190,30757142,30751471,30748493,30749120,30754680,30748846,30747789,30751583,30748431],"parent":30744925,"text":"I&#x27;m concerned that the majority of &quot;should we fix college or should we circumvent college&quot; conversations don&#x27;t bring up one of the scariest parts of our current economy: STEM jobs are the main viable path for economic stability and freedom.<p>All of the conversations I&#x27;ve seen implicitly assume that this is good, and that the solution to farmer workers (or other low paid workers) escaping poverty is to train them as software developers.<p>We <i>really</i> need farm workers, and most of them live in poverty. I love having more engineers, scientists, and doctors, but we desperately need non-STEM work to be a viable option","time":1647804437,"type":"comment"},{"by":"crackercrews","id":30745713,"kids":[30747963,30745955,30748547,30747934,30748721,30746121,30745910,30748210,30745884],"parent":30744925,"text":"Definitely agree that removing the SAT appears to be related to the upcoming supreme court case about affirmative action. COVID was a good reason to delay it for a couple years. But schools are pushing it out further. That makes no sense.<p>It seems the SAT is increasingly considered &quot;racist&quot; because it reveals racial disparities in learning. What&#x27;s next? Get rid of the driver&#x27;s license test because it turns that white kids pass it at a higher rate than black kids?<p>Sam mentions that schools could down-weight the SAT but should still consider it. Why don&#x27;t schools want to do that? My guess: if they have mediocre scores on record for a kid, then admitting him means reporting those scores to USNews. They&#x27;d rather not know that the kid has a score that would bring down their average.","time":1647804106,"type":"comment"},{"by":"Tretiotrr","id":30745764,"kids":[30747460,30747804,30746340,30746269,30748081,30749876],"parent":30744925,"text":"In Germany you study for free.<p>There was a video (perhaps even from kurzgesagt) which describes how critical it is for our society to allow as many people as easy access to knowledge as possible and not only for obvious reasons but also to increase the chance for all of us that the hidden genius is finding a cure for cancer.<p>You can even study for free in Germany as an non German. You know what happens? Those people might stay in Germany and make Germany a better country.<p>Imagine a world were we compete globally with the best education system. Let&#x27;s allow more people to shape our future.","time":1647804397,"type":"comment"},{"by":"wpietri","id":30745379,"kids":[30745477,30746013,30745991,30745574,30749991,30745414],"parent":30744925,"text":"This is kind of a weird mix of points. Ignoring his political axe-grinding, I think the value of a college degree is increasingly in question for many fields because the price has risen wildly for decades without a corresponding increase in market value. (Except perhaps for elite-institution degrees, which are more about the brand and the network than what people actually learn.)<p>I think we haven&#x27;t seen at least a partial collapse only because most American companies are bad at hiring, bad at investing in workers, and bad at keeping them. But imagine a company where programmers are happy and tend to say for years. That company might do just as well, or perhaps better, running an in-house boot camp and apprenticeship program as by hiring new grads.","time":1647801936,"type":"comment"},{"by":"qiskit","id":30750229,"kids":[30752426],"parent":30744925,"text":"I agree with most of his premises but I don&#x27;t see how his premises lead to his conclusion - US collge education is near to collapse.<p>1. School loan debts aren&#x27;t ideal and we should look for ways to eliminate them permanently. It&#x27;s ridiculous that american students have to start their adult lives with so much debt. However, the fact that so many students are willing to go into debt for college shows that they there is tremendous demand for college education. My alma mater has continuously raised tuition ( far higher than inflation ) and also increased enrollment and yet have no problem finding students. Even if they doubled the tuition, they would have no problem meeting their enrollment goals. The domestic and international demand for US college education is simply too great for it to collapse any time soon.<p>2. I&#x27;ve never worked with anyone in tech who didn&#x27;t have at least some college education. Maybe the college education wasn&#x27;t in CS, but they all had some college education. So the idea that tech companies are going to hire people without some college education seems suspect to me.<p>3. It&#x27;s blatantly obvious colleges are discriminating against asian students to a ridiculous degree and white students to some degree as well. It should stop but I don&#x27;t see how that would collapse US college education? Asian and white students still want and are going to get a college education.<p>4. Stopping standardized testing is also ridiculous. It shouldn&#x27;t be the only factor in admissions, but certainly we need some form standardized testing in the mix. Admissions should be given more data to work with, not less. But once again, I fail to see how this would collapse US college education.","time":1647836520,"type":"comment"},{"by":"raincom","id":30745864,"kids":[30745983,30757748],"parent":30744925,"text":"HYP (Harvard, Yale and Princeton), and top tier law schools (Harvard, Yale, Stanford), top tier b schools (Harvard and Stanford) still control the whole thing.<p>Sure, if you can ace leetcode like an olympiad, you can become a L7 at FAANG. However, if you are a MBA from San Jose state, you would be working as a financial analyst. However, if you are a Stanford MBA, you would be a SVP.<p>Top tier firms in PE, VC, IC, and top tier consulting companies still go for elite colleges. Why? That is the path to c-level positions (not leetcode). Same thing for big law. Same thing goes for Washington consensus (the cesspool of Beltway), where pedigree matters.","time":1647805090,"type":"comment"},{"by":"spywaregorilla","id":30745368,"kids":[30745516,30745474,30748195,30745547,30745488,30745455],"parent":30744925,"text":"Seems like a pretty unremarkable collection of surface level observations if you ask me","time":1647801847,"type":"comment"},{"by":"Izkata","id":30748979,"kids":[30749066,30749062],"parent":30744925,"text":"&gt; It seems very clear that elite colleges discriminate against Asian-American students, and that the Supreme Court is going to find this. (One expert said  no discrimination would result in around 65% Asian-American admits.)<p>&gt; The fact that this has been so tolerated speaks volumes.<p>Tolerated?  It&#x27;s been <i>encouraged</i> for at least two decades, under the name &quot;affirmative action&quot;.","time":1647826169,"type":"comment"},{"by":"nimithryn","id":30747838,"kids":[30748782,30747855,30747881,30749042,30748105],"parent":30744925,"text":"Some of these points are correct. College does seem to be providing less value in the US, etc. Maybe some third-tier universities could be in trouble if there&#x27;s a decline in college attendance.<p>But, &quot;collapsing&quot;? Universities are one of the most long-lived types of institutions known to humankind. Oxford was founded in 1096. I suspect they will be around quite a lot longer.","time":1647818341,"type":"comment"},{"by":"devwastaken","id":30751587,"kids":[30752797],"parent":30744925,"text":"Tuition and living costs have artificially doubled since 2010 across the board, if not tripled.<p>If you went to school more than 5 years ago it is entirely different. Classes are held online, even on campus. Almost everything is done digitally and online.<p>Student suicide, depression are sky rocketing. COVID rules have completely changed how campus living works - students would rather be on TikTok than be forced to wear masks or get forcibly &quot;quarantined&quot; (legal jail cell). Yes, that is real, it goes on every day. Students are not allowed to protest universities, the law in all states is written in such a way that you have no tenant rights, no representation, and the University can do as they please. They reap the benefits of a private org (predatory contracts) while socializing the cost (grants&#x2F;loans)<p>That money from housing and tuition is absorbed into a black hole, it is not used for student programs. It is not used to improve education. We cannot get basic equipment. We cannot provide a proper education.<p>Universities have been overrun by blue types that are now forcing even more unnecessary and politically motivated classes, promoting activism and specific kinds of beliefs as if they are academic. They&#x27;re cherry picking academic knowledge for what aligns to their politics.<p>The core competencies are underfunded, students don&#x27;t receive the help they need, and are overshadowed by the admins shiny new false humanities programs.<p>Students this summer will go homeless because they cannot pay for summer housing. Uni housing charges exorbant artificial pricing well above market. Again, private profits, social costs.<p>Students cannot afford an education, and even those that do don&#x27;t get a quality education outside of a few top universities. This is unsustainable, but various beliefs prevent us from doing the right thing - defunding.<p>We need a mass firing and reorganization of American education.","time":1647850748,"type":"comment"},{"by":"Jerrrry","id":30745678,"parent":30744925,"text":"The government should pull out of student grants and loans.<p>Unfortunately, the &quot;double pell&quot; movement means people paying out of pocket are soon going to have to pay double.<p>What a coincidence, that the average degree costs the average student loan package.<p>Stop subsidizing education. Let the market forces actually allow for a fair price discovery, or else that college degree is as valuable in a sense as crypto  is...its intrinsic value - use case - job improvement prospects, multiplied by a coefficient of speculation.<p>I say this as someone who has had a massive impact on the student aid lifecycle, and yet didn&#x27;t go to college myself, because ironically, wasn&#x27;t able to fill out the FAFSA form.","time":1647803868,"type":"comment"},{"by":"holdenc","id":30750184,"kids":[30751504],"parent":30744925,"text":"While I agree that 200K in debt for a BA in English is not a wise choice, there&#x27;s a whole class of families that can afford the 200K out of pocket, and will happily pay it for a top school.  I have a child, and will do it for the following reasons:<p>- You only get one chance to be 18 - 22 years old.  College is a great way to improve your appreciation of culture, society, and build social skills, prior to taking a full time job.<p>- I know many youngsters here will likely have a problem with this -- but the average 18 year old has some intellectual and emotional maturing to do.  This can happen via the social and academic challenges of college.  In fact, the best colleges will sell this over any practical skills.<p>Work life can be a grind, even for someone with their dream job.  When was the last time you had a chance to try your hand at literary criticism, or game theory, or learning a new language?  How did it go the first time you had to ask for help with an intellectual problem? (Probably a distant thought in the minds of the average senior developer).  How about the last time you had to cooperate with several people you dislike?  College is a good place to get started with these things.","time":1647836163,"type":"comment"},{"by":"lordnacho","id":30745839,"kids":[30746300,30748424,30748417,30748418],"parent":30744925,"text":"The elephant in the room is that college doesn&#x27;t teach you anything you need to know at a job.<p>I&#x27;m not talking about the obvious exceptions like medicine or law (though even that can be done as a conversion rather than an undergrad degree) or anything else where you literally need the paper that says you can do it. I&#x27;m also not talking about becoming a researcher, where obvious you need to know a bit of X to become a professor of X. I&#x27;m talking about the vast number of degrees that are not job specific. Business, economics, history, literature, and so on with humanities, but also math, chemistry, physics, and biology.<p>There is no real reason an employer would care what you studied, because as a new graduate your job is to learn the business. Whether you were interested in one thing or another in college doesn&#x27;t matter much, the main line is between math-tech stuff and not-math-tech stuff. Employers who reckon their work is techie will gravitate towards those graduates, while others will be open to anyone.<p>All the degree signals is that you somehow gathered yourself and read a bunch of books and solved a bunch of questions. That&#x27;s somehow supposed to be evidence that you can learn their business.<p>Of course the problem is there&#x27;s plenty of people who instead of learning Krebs cycle could just go directly into finance or accounting or any number of jobs without jumping through the hoops. The issue is that college has become a destination for so many smart kids, it&#x27;s hard to imagine a smart kid who skips it. So absolutely everyone feels they need to go to college, and absolutely every employer thinks they need to hire just college grads.<p>In terms of helping the economy, it&#x27;s really not efficient. Everyone has to sit around for three or four years when they really want to be working, and everyone who can&#x27;t find the money&#x2F;time to do it is cut out from middle class aspirational jobs.","time":1647804961,"type":"comment"},{"by":"mathattack","id":30753627,"kids":[30753711,30753740],"parent":30744925,"text":"There is a lot of talk about decoupling universities, and their coming collapse.  Let me take the contrary opinion, and defend why they will stay. (This is not a defense of their efficacy, only their economics)<p>Private non-profit universities are essentially run by their tenures faculty. At prestigious universities the focus is primarily research.  Everything they do should be in the eyes of this stakeholder group.<p>The “undergraduate experience” exists as a profit center to fund the tenured faculty. Sports teams and fancy dorms (and binge drinking) are more important (and easier to quantify) to the buyers of education than educational quality so that’s where the investment goes.  Buyers will choose “facilities and brand” over education enough to keep the schools looking elite.  As long as admissions grades and test scores are high enough, the rest doesn’t matter.  (The kids will succeed in life anyway)<p>At “for profit” universities just replace the tenured faculty with shareholders. Same model just no pretense of research.<p>For 2nd and 3rd tier universities it’s similar but with much less money to go around.  (Less endowment and tuition)<p>Layer onto this that the government is guaranteeing the bill and you have no incentive for the folks in charge to change their behavior.<p>As a society we can say we are tired of being on the hook, but until that happens there is a lot of inertia to overcome.  That’s why we didn’t see a mass collapse of universities in any of the last 4 recessions.","time":1647867862,"type":"comment"},{"by":"mbgerring","id":30752053,"parent":30744925,"text":"This is a great example of a persistent problem in contemporary American public discourse — when a wealthy person goes on Twitter and makes an off-hand comment about some stuff he heard from friends or on a podcast or whatever (he doesn’t say, so you’re left to just guess), people receive it as wisdom, instead of the bullshit[1] that it is.<p>1. <a href=\"https:&#x2F;&#x2F;press.princeton.edu&#x2F;books&#x2F;hardcover&#x2F;9780691122946&#x2F;on-bullshit\" rel=\"nofollow\">https:&#x2F;&#x2F;press.princeton.edu&#x2F;books&#x2F;hardcover&#x2F;9780691122946&#x2F;on...</a>","time":1647855369,"type":"comment"},{"by":"anotherhue","id":30745369,"kids":[30745718,30747743,30745475],"parent":30744925,"text":"Twitter &#x27;threads&#x27; are bad and people should feel badly for creating&#x2F;posting them.","time":1647801850,"type":"comment"},{"by":"cowanon6767","id":30748818,"parent":30744925,"text":"This is demonstrably false - there may be a few edge cases where companies are making degrees optional, but overall the trend is in the opposite direction. (The companies bypassing the degree requirement all have their own very rigorous selection requirements; the number of non-college graduates who can meet the requirements is very small.)<p>Companies are using college diplomas as the new high school - even some help desk jobs prefer college students or recent graduates now.  It seems like almost all companies require a college degree for even slightly senior positions - a high school graduate will be very limited in career progression.  Degrees are now a necessary but not sufficient condition for most people.<p>As far as price, most U.S. states have an excellent public university system - you would have to be insane to pay private school prices for anything but a top 5 university.","time":1647824745,"type":"comment"},{"by":"adamlynch","id":30733344,"kids":[30737946,30735094,30736240,30738546,30736171,30750283,30737624,30742197,30739107,30748752,30741111,30737930],"parent":30733339,"text":"Hi HN, I made Back Of Your Hand, a map-based game where you&#x27;re given random street names and you have to locate them on the map. You can play solo or compete with friends on other devices.<p>I made it for my dad as a Christmas present. It also gave me an opportunity to learn about geocoding, etc.<p>Tech: serverless, Leaflet, Turf, Svelte, TypeScript, Cloudflare pages. I tried to use as many open &#x2F; free tools as I could. I originally used map tiles from OpenStreetMap but they were discontinued so it uses Mapbox and Maptiler now.<p>Questions &#x2F; feedback welcome. I also wrote a blog post with more information: <a href=\"https:&#x2F;&#x2F;adamlynch.com&#x2F;back-of-your-hand\" rel=\"nofollow\">https:&#x2F;&#x2F;adamlynch.com&#x2F;back-of-your-hand</a>. The code: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;adam-lynch&#x2F;back-of-your-hand\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;adam-lynch&#x2F;back-of-your-hand</a><p>Warning: it’s pretty difficult, unless your streets are numbered :)","time":1647694252,"type":"comment"},{"by":"imadethis","id":30734900,"kids":[30734969],"parent":30733339,"text":"This would be actually helpful practice for first responders. FDs&#x2F;EMS in my area are expected to memorize all of the streets in their region, and I imagine it’s the same for PDs too. Another layer on top of it would be to quiz you on how to get from a fixed point (the station) to a random intersection. For the US, you could also provide a random block on a street rather than an intersection.","time":1647705972,"type":"comment"},{"by":"traceroute66","id":30734219,"kids":[30734292],"parent":30733339,"text":"Fun, but you know what would be really cool ?<p>A Blue Book mode.<p>For those unfamiliar Blue Book refers to test &quot;runs&quot; done by London taxi drivers when they do The Knowledge[1].<p>It would be fun to be given, say <i>&quot;Australian High Commission, WC2 to Paddington Station, W2&quot;</i> and have to place multiple pins on the map and then graded on your result.<p>[1] <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=my4lDxOCCyg\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=my4lDxOCCyg</a>","time":1647701646,"type":"comment"},{"by":"piceas","id":30733706,"kids":[30734627],"parent":30733339,"text":"Neat. Unfortunately appears to be limited to streets in your local area. I hoped&#x2F;expected a list of interesting destinations in the area such as art installations, parks, or even popular restaurants etc.","time":1647698046,"type":"comment"},{"by":"lcuff","id":30738471,"kids":[30738620,30741177,30738510],"parent":30733339,"text":"Here is a different quiz about what you know about your local area.  Pretty interesting.<p><a href=\"https:&#x2F;&#x2F;kk.org&#x2F;thetechnium&#x2F;the-big-here-quiz&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;kk.org&#x2F;thetechnium&#x2F;the-big-here-quiz&#x2F;</a>","time":1647732183,"type":"comment"},{"by":"function_seven","id":30735919,"parent":30733339,"text":"This is a fun game!<p>I tried 2 areas: where I live today and where I delivered pizzas 20 years ago.<p>3&#x2F;5 for my local area, 5&#x2F;5 for my old stomping grounds. I’m no London taxi driver, but I do have a bit of Knowledge about my old neighborhood. We didn’t have GPS back then and we liked it!<p>The size of the circle was perfect. Just large enough to challenge, but not so large that random tiny streets miles away trip the player up.","time":1647712355,"type":"comment"},{"by":"aasasd","id":30741228,"kids":[30742410],"parent":30733339,"text":"Very nice. I actually wanted to concoct something like this for Anki, with large streets of the city—since in this sprawl I sometimes only vaguely know what&#x27;s on the other end of it. But didn&#x27;t think that web maps could serve me for that.<p>Some minor nitpicks:<p>- If you could allow zooming in&#x2F;out with double-tap-and-drag on phones, that would be cool. Specifically it would help with one-handed use.<p>- On a ‘square’, the road can go right around the pin, so the distance is measured inside this circle, and I get &lt;100 points. Frankly I should&#x27;ve guessed that this would be the case, but kinda prefer that the app would do it for me.<p>- Perhaps there&#x27;s not much use in offering streets that only have like a hundred meters inside the radius—especially since the page doesn&#x27;t allow scrolling outside the circle, to more comfortably tap the street and not aim at the small chunk of it.<p>- OTOH it would be better if I could scroll somewhat outside the circle, to have the streets in the middle of the screen where it&#x27;s more convenient to look and tap.<p>As a side remark: using this in European-style compact cities, especially in ‘old towns’, can be quite a hardcore mode. In the 19th century, the region in the circle comprised the whole city and some outskirts, so now there are a lot of old streets in this area. And with my smaller native city (half a million people), the circle covers most of it.","time":1647767550,"type":"comment"},{"by":"lwkl","id":30733945,"kids":[30737848,30733996],"parent":30733339,"text":"This is crazy hard it covers my whole city and parts of the metropolitan area. I guess you will have to play this a lot to get any good at it if you are living in a medium sized city in central Europe. :)<p>Edit: I think you should be able to make the radius a little bit smaller or add an option to choose from different radii.","time":1647699866,"type":"comment"},{"by":"ajsnigrutin","id":30738139,"kids":[30738319],"parent":30733339,"text":"Fun &quot;game&quot;, but asking you to identify one of the main roads, vs some minor, three-house road makes it very luck-based.<p>Also, I clicked directly on the (correct) road, and it took the points away, because the hitbox was off<p><a href=\"https:&#x2F;&#x2F;i.imgur.com&#x2F;yKONWUk.png\" rel=\"nofollow\">https:&#x2F;&#x2F;i.imgur.com&#x2F;yKONWUk.png</a><p>(Topniška ulica, Ljubljana, Slovenia)","time":1647729079,"type":"comment"},{"by":"tkgally","id":30739571,"kids":[30742442],"parent":30733339,"text":"Great game. You may have a viral hit on your hands.<p>A few comments:<p>I tried it first in Yokohama, Japan, where I have lived for more than twenty years. It worked well. Although most streets here don’t have names, the game called up the names of bridges, highways, and even a moving walkway, which was fun. I then tried Osaka, which I have visited many times, and it worked well there, too.<p>In both cases, the names appeared in Japanese script, which works for me because I read Japanese. If the OpenStreetMap data for some locations is multilingual, you might want to give users the option of choosing the display language for the choices. Also, you might offer a wider range of landmarks for people to choose from. In Japan, the names of districts, buildings, parks, railways stations, bus stops, rivers, and mountains would be nice to include. I tried Manhattan, too, and half of the choices were numbered streets and avenues, which got boring quickly; the names of buildings, squares, parks, etc. would make it more interesting.<p>In the two Japanese cities, after I entered my choice, the map highlighted the correct location with a dotted line leading to it; I assume that was the intended behavior. When I tried it for Pasadena, California, where I grew up, and Manhattan, though, that highlighting did not appear and the dotted line just went off to the left side of the screen. I used Safari on MacOS. See the following screenshots:<p><a href=\"http:&#x2F;&#x2F;gally.net&#x2F;temp&#x2F;yokohama.jpg\" rel=\"nofollow\">http:&#x2F;&#x2F;gally.net&#x2F;temp&#x2F;yokohama.jpg</a><p><a href=\"http:&#x2F;&#x2F;gally.net&#x2F;temp&#x2F;pasadena-california.jpg\" rel=\"nofollow\">http:&#x2F;&#x2F;gally.net&#x2F;temp&#x2F;pasadena-california.jpg</a><p><a href=\"http:&#x2F;&#x2F;gally.net&#x2F;temp&#x2F;newyorkcity.jpg\" rel=\"nofollow\">http:&#x2F;&#x2F;gally.net&#x2F;temp&#x2F;newyorkcity.jpg</a><p>Finally, a search box to find the start location would be nice. It was cumbersome to zoom out, scroll from Japan to Manhattan, and then zoom back in.","time":1647744299,"type":"comment"},{"by":"pivo","id":30734663,"kids":[30734789],"parent":30733339,"text":"I failed completely because in my selection (US: Boston&#x2F;Cambridge) there are multiple streets with the same name like Broadway and First Street, and I always picked the wrong one.","time":1647704466,"type":"comment"},{"by":"bussiere","id":30737964,"kids":[30737970],"parent":30733339,"text":"Good concept but the circle on european city may have too many streets to know them.<p>having the option to choose the size of the circle could be nice :)","time":1647727471,"type":"comment"},{"by":"Ultimatt","id":30741184,"kids":[30741842],"parent":30733339,"text":"Scoring is super harsh for the UK where we don&#x27;t have a grid system and a million small streets.","time":1647766735,"type":"comment"},{"by":"cerivitos","id":30741439,"kids":[30742277],"parent":30733339,"text":"Love it! As many pointed out, playability is quite dependent on where you live. Perhaps you could also use landmarks rather than streets, but I&#x27;m guessing OpenStreetMap POI data is not as robust as Google Maps... And Google Maps Places API is expensive :)","time":1647770745,"type":"comment"},{"by":"alistairSH","id":30735983,"kids":[30736267,30736009],"parent":30733339,"text":"No map loading for me - too much traffic? Safari on iOS.","time":1647712670,"type":"comment"},{"by":"rsstack","id":30734181,"kids":[30741442,30735154],"parent":30733339,"text":"I didn&#x27;t realize it was just going to be street names, and picked my area in Manhattan. The streets and avenues are numbered :)","time":1647701356,"type":"comment"},{"by":"microtherion","id":30739085,"kids":[30741053,30741436,30742248],"parent":30733339,"text":"Great game! The one &quot;unfair&quot; question I got was &quot;Treppe Tiefgarage&quot; which means &quot;Stairs to the underground parking garage&quot;. Difficult to figure out how to filter these out in the general case.","time":1647738760,"type":"comment"},{"by":"Normal_gaussian","id":30734011,"kids":[30734096],"parent":30733339,"text":"This is fantastic. My gf and I have been playing it in a cafe, and doing abysmally - but just sent it to our parents who will greatly enjoy quizzing themselves! Thanks, you&#x27;ve made our day a little bit funner and help keep our families a little bit closer.","time":1647700324,"type":"comment"},{"by":"lienhoangduy","id":30755057,"kids":[30755568],"parent":30733339,"text":"Hey, It&#x27;s a really fun app. Congratulations on the launch! \nSome small feedbacks: \n- The radius should be adjustable\n- Compete with friends (Can make it viral)\n- Don&#x27;t know how it calculates the point. Sometimes I choose the place very far from the target but I&#x27;ve gotten a higher score than the time I chose the near one.","time":1647875834,"type":"comment"},{"by":"ladberg","id":30737887,"kids":[30737913],"parent":30733339,"text":"Pretty cool! As a suggestion it might be a good idea to copy one of Wordle&#x27;s simple-but-genius features and make it easy for users to share a text based summary of their results with others.","time":1647726802,"type":"comment"},{"by":"zamadatix","id":30730304,"kids":[30730959,30731994],"parent":30729212,"text":"It&#x27;s a bit early (obviously, hence Alpha) but if the pace and purpose of the project make you excited consider bumping a few dollars towards the donation links in the article to help these folks afford to get it done. Marcan is a wizard and Povik has been making great progress but these machines aren&#x27;t cheap nor their time unlimited!","time":1647656576,"type":"comment"},{"by":"jasoneckert","id":30730127,"kids":[30732636],"parent":30729212,"text":"I just installed this - the installation experience was easy and guided you through the tasks that were happening and why. I gave it 100GB of space on my 16GB Mac Mini, and Asahi runs incredibly fast and smooth. Very impressed!","time":1647654861,"type":"comment"},{"by":"n42","id":30729930,"kids":[30730077,30730538],"parent":30729212,"text":"this is incredible, congratulations to everyone involved in making this happen. there&#x27;s already instructions for a NixOS install, too[1]<p>[1]: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;tpwrules&#x2F;nixos-m1&#x2F;blob&#x2F;main&#x2F;docs&#x2F;uefi-standalone.md\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;tpwrules&#x2F;nixos-m1&#x2F;blob&#x2F;main&#x2F;docs&#x2F;uefi-sta...</a>","time":1647653088,"type":"comment"},{"by":"tyingq","id":30730008,"kids":[30730697,30730028,30732154],"parent":30729212,"text":"Probably won&#x27;t happen, but it&#x27;s interesting that all the things you would need for an &quot;x-serve next-gen&quot; to be successful have fallen into place now.  Would make a pretty power packed and efficient 1U machine.","time":1647653801,"type":"comment"},{"by":"_ph_","id":30732589,"kids":[30733726],"parent":30729212,"text":"Exciting news! While I am mainly a Mac user, Linux is the other operation system I use (usually via VM on the Mac) and the one alternative operating system I would use, if I would not have a Mac. Being able to boot into Linux directly adds a lot of value. While I don&#x27;t have an ARM Mac yet, this gives even more incentive to order a Mac Studio :) (I assume support for that is coming soon).<p>I am wondering why Apple doesn&#x27;t support this more directly. That would be just a tiny drop out of the marketing budget. But at least there seems to be some good will in the relevant OS department with recent changes from which Asahi Linux benefited.<p>On a side note, as long as the graphics are CPU rendered, is this rendering multi-threaded and would benefit from the beefier M chips?","time":1647684934,"type":"comment"},{"by":"legodion","id":30731015,"kids":[30731081,30731124],"parent":30729212,"text":"Ironically a MacBook would be the best hardware Linux could presently run on.<p>If everything works reliably well, this could be a game changer for Linux.","time":1647664089,"type":"comment"},{"by":"dang","id":30731891,"parent":30729212,"text":"Related:<p><i>Linux on an M1 Mac</i> - <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=30717758\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=30717758</a> - March 2022 (136 comments)<p><i>AsahiLinux&#x27;s Introduction to Apple Silicon</i> - <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=30699794\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=30699794</a> - March 2022 (5 comments)<p><i>Asahi Linux Add Support for the Broadcom FullMAC WiFi Chips Used on Apple T2&#x2F;M1</i> - <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=29694497\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=29694497</a> - Dec 2021 (9 comments)<p><i>Apple Helps Asahi Linux</i> - <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=29591578\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=29591578</a> - Dec 2021 (174 comments)<p><i>Asahi Linux for M1 Macs Progress October-November 2021</i> - <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=29564384\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=29564384</a> - Dec 2021 (211 comments)<p><i>Asahi Linux for M1 Macs: progress report for September 2021</i> - <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=28762744\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=28762744</a> - Oct 2021 (186 comments)<p><i>Asahi Linux for Apple M1 progress report, August 2021</i> - <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=28180135\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=28180135</a> - Aug 2021 (183 comments)<p><i>Asahi Linux Progress Report: January&#x2F;February 2021</i> - <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=26421963\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=26421963</a> - March 2021 (65 comments)<p><i>Asahi Linux: Linux on Apple Silicon project</i> - <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=25649719\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=25649719</a> - Jan 2021 (405 comments)","time":1647674719,"type":"comment"},{"by":"watmough","id":30730736,"parent":30729212,"text":"Awesome!! Posting from it now after about 2 hours or so to backup some stuff and run through the installer with a couple glasses wine.<p>Super slick. No issues.","time":1647660966,"type":"comment"},{"by":"jaime10","id":30730159,"kids":[30730567],"parent":30729212,"text":"I made a quick guide to install and configure Sway on the Macbook Air. Should be useful to solve some touchpad and scaling issues with the defaul sway settings.\n<a href=\"https:&#x2F;&#x2F;github.com&#x2F;jaime10a&#x2F;SwayM1\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;jaime10a&#x2F;SwayM1</a>","time":1647655136,"type":"comment"},{"by":"gjsman-1000","id":30730069,"parent":30729212,"text":"Wrote this reply from Asahi which I installed earlier this afternoon before the announcement. Works well and the installer was pretty good for alpha. :)","time":1647654251,"type":"comment"},{"by":"DougMellon","id":30729250,"kids":[30729592],"parent":30729212,"text":"The work they have accomplished and the speed at which they have done it is inspiring.","time":1647647970,"type":"comment"},{"by":"qiskit","id":30729994,"kids":[30730042,30730021,30730136],"parent":30729212,"text":"&gt; At least 53GB of free disk space (Desktop install)<p>Wowsa. I know disk space is abundant but that is still shocking. I&#x27;ve never used MacOS, but why does it need at least 38 GB free for MacOS update?<p>&gt; You need 15GB for Asahi Linux Desktop<p>Wowsa number 2. I&#x27;m used light installs using lightweight windows managers or desktops so that number was a bit shocking. Anyone else prefer a small base onto which you can add software rather than getting everything and having to uninstall a bunch of software?","time":1647653667,"type":"comment"},{"by":"cloudwizard","id":30730517,"kids":[30731072,30730559,30730908],"parent":30729212,"text":"Excited about this.  I like the Mac HW but hate MacOs.  I can&#x27;t delete iTunes, books, etc.  Switched development to a Chromebook for a decent Linux experience.","time":1647658687,"type":"comment"},{"by":"boris","id":30731671,"kids":[30732367],"parent":30729212,"text":"Does anyone know if virtualization (e.g., kvm&#x2F;qemu) would work? Didn&#x27;t see any mention of that in the FAQ.","time":1647671387,"type":"comment"},{"deleted":true,"id":30730167,"parent":30729212,"time":1647655220,"type":"comment"},{"by":"gundamdoubleO","id":30731660,"parent":30729212,"text":"Excited to try this out. Still missing a few crucial features for me to fully adopt it as a daily driver but the speed of this project has been incredibly impressive. Can&#x27;t wait to see how it looks 1 or 2 years down the line.","time":1647671284,"type":"comment"},{"by":"blindmute","id":30731074,"kids":[30731135,30731142,30731154],"parent":30729212,"text":"I&#x27;m out of the loop on this one. Is M1 a new architecture, and if so does that mean any distro would have to recompile every package in the repo to target it? How long would that take for a typical distribution?","time":1647664657,"type":"comment"},{"by":"beebeepka","id":30731610,"parent":30729212,"text":"Current Apple hardware is pretty sweet. My heart has been with AMD for decades but if they make this work, in a few years I might buy my first Mac.","time":1647670751,"type":"comment"},{"deleted":true,"id":30730285,"parent":30729212,"time":1647656310,"type":"comment"},{"by":"xiaodai","id":30730719,"parent":30729212,"text":"Still waiting for my Budweiser Linux","time":1647660777,"type":"comment"},{"by":"thr0wawayf00","id":30724787,"kids":[30725104,30724956,30725271,30725171,30725912,30725611,30732599,30724884,30730973,30733351,30727919,30732162,30725531,30728278,30730605,30728430,30725165,30726147,30726765,30727404,30724910,30734830,30726056,30725552,30731465,30725921,30724958,30727000,30725408,30738441,30728793],"parent":30723890,"text":"The scary thing is that it&#x27;s easy to see how something how like this could drive a market boom and bust cycle. I&#x27;m imagining a scenario where two iBuyer companies try to outbid each other algorithmically, driving the prices further and further out of reach of people who are looking for a primary home.<p>Tangentially related, I talked to a friend who works on geospatial data for one of the big vacation rental companies, and he was remarking how many homes in many desirable areas are now rentals. It&#x27;s not that uncommon to see nearly entire neighborhoods converted to short term rentals now in some areas where they&#x27;re still legal. Hearing that really depressed me.<p>We often talk about automation in terms of replacing various types of labor, but I&#x27;ve become really interested in automation creating adverse market incentives for smaller market participants because that&#x27;s exactly what buying real estate right now feels like.<p>It&#x27;s honestly quite scary how I&#x27;m in the top 2% of income earners in my generation and yet I could barely afford to buy a small place in a semi-desirable area.   I can easily see myself not being able to compete in algorithmically dominated markets flush with venture cash in the future and I earn more than just about everybody I know today.","time":1647623448,"type":"comment"},{"by":"bastawhiz","id":30724726,"kids":[30724927,30725007,30727803,30725854,30728388,30727749],"parent":30723890,"text":"I recently bought a home. We toured a Zillow home, and I can understand what they were going for and where they failed.<p>We were able to pull up to the driveway, book a tour for that minute, and walk in the front door. It was almost a magical experience compared to the process of finding and going to showings. The listings were clear and thorough. The experience was extremely compelling.<p>The downside: the homes were absurdly overpriced. I bought a home for about 10% less than the last Zillow listing. For less, I got three times the land, 40% more square footage, a better location, updated appliances, new carpets, landscaped back yard, horseshoe driveway, two car garage. Almost zero effort had been put into modernizing the Zillow home and it showed.<p>I suspect if I had come in with a very low offer, they&#x27;d have accepted it. But for what?<p>If I was Zillow, I&#x27;d have licensed the tech to realtors. I&#x27;d definitely be inclined to buy a home through them if they weren&#x27;t the ones selling the property directly.","time":1647623177,"type":"comment"},{"by":"encoderer","id":30724937,"kids":[30727165,30727711,30725781],"parent":30723890,"text":"I was at Zillow for many years and left in 2020. On the tech side the pivot into iBuying was absolutely bonkers. The message from senior leadership was basically: I have no idea what your teams should be working on but it’s definitely not what they are currently working on so stop that and figure something else out.<p>This has nothing directly to do with their market failure but they probably are driven by the same leadership problems.","time":1647624130,"type":"comment"},{"by":"dpierce9","id":30724859,"kids":[30725042,30726251,30725000],"parent":30723890,"text":"Anecdote on the estimates. We bought a house for X and renovated it. The day before we listed it both Zillow and Redfin estimate had an estimate around the purchase price X. When we listed it for 2X, both companies changed their estimate to be close to the listing. However, Redfin changed the entire price history as well showing a gentle slope. Zillow preserved their previous history and showed a spike.","time":1647623763,"type":"comment"},{"by":"skrtskrt","id":30726576,"kids":[30733441,30731187],"parent":30723890,"text":"Some twitter threads from Zillow insiders I saw around this referenced a couple things:<p>* the pricing algorithm was good, but the business leadership got hungry and kept overriding it with higher offers in the hunger to do more business.<p>* they were trying to do so much business that they couldn&#x27;t source the labor need to flip - painting, landscaping etc. They were so backlogged they were just sitting on houses they overpaid for (due to overriding the algorithm), and the constant cashflow aspect that makes flipping work at scale was destroyed<p>Matt Levine&#x27;s take was something like:<p>if the pricing algorithm is good but it tells you that the flip strategy is only profitable on relatively small number of properties, then it&#x27;s not profitable at scale cuz you&#x27;re paying a big engineering team to create, tune and maintain it.","time":1647632456,"type":"comment"},{"by":"projektfu","id":30726071,"kids":[30733464],"parent":30723890,"text":"The author buried the lede.  Zillow came up with a model to choose bid and ask prices.  The model said, &quot;Don&#x27;t buy&quot;.  They didn&#x27;t believe the model and chased the deal, and lost money.<p>Sometimes it&#x27;s better to sit on your hands.","time":1647629707,"type":"comment"},{"by":"jjice","id":30725070,"kids":[30725545,30727503],"parent":30723890,"text":"It&#x27;s such a glaring red flag that one of the largest public resources for getting pricing information on housing is also buying and selling that housing. Come on, this is so glaringly abusable that any teenager could tell you what&#x27;s wrong.","time":1647624748,"type":"comment"},{"by":"mistrial9","id":30724770,"kids":[30724879],"parent":30723890,"text":"I am especially annoyed at Zillow SF holding &quot;Data Science&quot; meetups in San Francisco at the penthouse place, while advertising for TWO data science positions.. meanwhile, frat guys are at the golf course by the dozens, across three states. The people that they hired at that time, probably built this setup exactly as <i>required</i> by the frat guys. Happy banking Zillow!","time":1647623379,"type":"comment"},{"by":"buzzdenver","id":30724824,"kids":[30727338,30725664],"parent":30723890,"text":"The author has a valid point in that the information asymmetry will attract sellers whose property is overvalued to sell to Zillow. I suspect though that something different happened in reality. I live in a 70 unit condo building, so there are a lot of very good comparables. Zillow bought one of the units about 10% over market value, which makes me think that they&#x27;re doing some sort of market manipulation, like charging a 20% fee that is not part of the real estate record. So they wanted to pump up prices, but it didn&#x27;t work.","time":1647623597,"type":"comment"},{"by":"alecbz","id":30727371,"parent":30723890,"text":"&gt; Here’s the problem: my autodraft team ended up with a roster almost exclusively stocked with the players idiosyncratically overrated by Yahoo!. For example, an older player whose younger backup had just earned praise from the coach, suggesting that he might be about to lose his job.<p>I guess this is pretty obvious but just to be explicit, what&#x27;s happening I guess is that players that are &quot;correctly&quot; valued by the algorithm are getting taken by others, and only the overvalued ones are left for the algorithm to choose.","time":1647636757,"type":"comment"},{"by":"h2odragon","id":30724138,"kids":[30724925,30724842,30724668,30724591],"parent":30723890,"text":"Zillow&#x27;s estimates of home values in my area have consistently been 150% of actual prices, as far as I&#x27;ve seen over the past years. Not that I&#x27;ve looked that closely and given that this is a hard area for them with low sales and a broad range of values for reasons not easy for their algorithms to quantify.<p>However, I always took that to be intentional, sort of a &quot;see how valuable your home is &#x2F; how high the values are where you&#x27;re looking at&quot;; hype that cost them nothing but made everyone feel better. Did the person that set that &quot;glamor bonus&quot; fudge factor get fired or just wasn&#x27;t allowed to talk to the team deciding offer prices?","time":1647620364,"type":"comment"},{"by":"JRKrause","id":30725284,"parent":30723890,"text":"Zillow purchased a home in my neighborhood for $370K, is now trying to sell it for $410K. Prior to this purchase other houses with a larger footprint in our exact same neighborhood were selling for $250K(literally just months before). For some reason zillow chose to pay 100K over what would have been fair value for the house.","time":1647625732,"type":"comment"},{"by":"ourmandave","id":30725202,"kids":[30725307],"parent":30723890,"text":"I&#x27;m planning to sell very soon and love the iBuyer model.<p>Don&#x27;t have to deal with showings, or fix anything, or hope a buyer&#x27;s financing doesn&#x27;t fall through at the last minute. To me that&#x27;s worth whatever percent they&#x27;re getting.<p>Sadly, no iBuyer operates in my fly-over state.","time":1647625320,"type":"comment"},{"by":"ridaj","id":30725847,"parent":30723890,"text":"Re opendoor etc<p>&gt; A less competitive market is less dynamic and worse for sellers, but it is better for the iBuyers that remain.<p><i>If</i> they can avoid taking on the bad deals that Zillow was previously shielding them from. I&#x27;ve seen how in some markets the disappearance of a provider that falls victim to this kind of adverse customer selection merely moves the problem to other providers in a cascading fashion. It&#x27;s not clear that there are that many profitable deals to be made on the iBuying model","time":1647628515,"type":"comment"},{"by":"CloudYeller","id":30726263,"parent":30723890,"text":"I bet humans could have done a lot better than -$881M, and it wouldn&#x27;t have been very costly to employ them.  How many homes did Zillow iBuy in total, 10-20k?  If it takes 5 minutes to evaluate a house, that would be 100,000 minutes, which is ~50 people working full time for a week.  Spending $100k on that could have saved 100s of millions, plus it might have generated better training data for the model.","time":1647630575,"type":"comment"},{"by":"rahimnathwani","id":30725812,"parent":30723890,"text":"&quot;Do market makers in the stock market run into this problem?&quot;<p>Yes, that&#x27;s why they have to account for the probability that whoever hits their bid is an informed trader (vs. uninformed&#x2F;noise trader). And it&#x27;s part of the reason they can provide price improvement when they source order flow from retail brokers, whose customers are mainly uninformed&#x2F;noise traders.","time":1647628349,"type":"comment"},{"by":"cloutchaser","id":30727374,"parent":30723890,"text":"How did opendoor manage to do the same thing better? The article seems like a takedown of the model, but opendoor managed to do the same thing profitably.<p>From what I&#x27;ve read it seems Zillow never had the actual expertise to do this, they were always a house price checking site. On the other hand opendoor started out doing this from the start.","time":1647636765,"type":"comment"},{"by":"prototypeasap","id":30725372,"kids":[30725675],"parent":30723890,"text":"I recall reading months ago that Zillow made cash offers with inspections waived, in order to expedite the process. I believe they had an algo which would access average repair cost which they would factor in the actual offer.<p>Each house needs to be inspected by multiple experts as there are many toxic properties with huge liabilities.","time":1647626120,"type":"comment"},{"by":"PaulHoule","id":30733553,"parent":30723890,"text":"Scale is the enemy of profitability for this.<p>If you make lowball offers you won’t have many accepted but you will make money on the ones they accept.  If you make higher offers you’ll be killed if anything goes wrong at all.","time":1647696615,"type":"comment"},{"by":"devmunchies","id":30725393,"kids":[30728900,30725791,30725647,30725574],"parent":30723890,"text":"&gt; <i>Zillow’s exit from the market strengthens the position of companies like Opendoor or Offerpad, which do something similar</i><p>Does Opendoor just have better algorithms&#x2F;models? What factors allow them to have different outcomes from Zillow?","time":1647626224,"type":"comment"},{"by":"geraldcombs","id":30745212,"kids":[30750114,30747383],"parent":30743141,"text":"As the blog post points out, this requires coordinating Wireshark&#x27;s &quot;(Pre-)Master Secret Log filename&quot; &#x2F; tls.keylog_file preference with you web browser&#x27;s environment, so a while back I wrote a Wireshark Lua plugin that automates as much of this as possible. It pops up a window that lets you launch Chrome or Firefox with the SSLKEYLOGFILE environment variable set to the correct value: <a href=\"https:&#x2F;&#x2F;gitlab.com&#x2F;-&#x2F;snippets&#x2F;2156054\" rel=\"nofollow\">https:&#x2F;&#x2F;gitlab.com&#x2F;-&#x2F;snippets&#x2F;2156054</a>","time":1647800752,"type":"comment"},{"by":"candiddevmike","id":30744139,"kids":[30744480,30744415,30745836,30747529,30744494,30744186],"parent":30743141,"text":"I was trying to hack&#x2F;reverse engineer some IoT API calls, and I really wish there was some middle ground between &quot;Don&#x27;t trust any network, encrypt everything end to end&quot; and &quot;I can MitM anything I want&quot;.  Everything on my network is a (sometimes literally) black box sending and receiving who knows what.  As a network operator, I should be able to MitM everything on my network.  But I don&#x27;t want people to MitM me when I&#x27;m on a public network, so I&#x27;m at a loss on how to fix this.","time":1647794172,"type":"comment"},{"by":"ThePhysicist","id":30745820,"parent":30743141,"text":"Neat, I didn&#x27;t know about SSLKEYLOGFILE, seems like a great way to debug apps that support it without installing custom root certificates.","time":1647804797,"type":"comment"},{"by":"ravishi","id":30744026,"kids":[30745447,30744541,30745677],"parent":30743141,"text":"How would one go about doing that for Android apps? I guess android apps don&#x27;t respect that flag?","time":1647793509,"type":"comment"},{"by":"kingforaday","id":30743655,"kids":[30745125,30743768,30744474,30743886,30743876,30751593,30744870,30744185,30743741,30743911],"parent":30743141,"text":"Pop Quiz: Who remembers Wireshark’s original name?<p>What a fun tool for over two decades!","time":1647791344,"type":"comment"},{"by":"2143","id":30751697,"parent":30743141,"text":"For academic purposes (in grad-school as part of my networks class), I have used T-Shark before to monitor packets.<p>(Shameless self-promotion) I had written a blog post about it back then. Here goes [1]<p>[1] <a href=\"https:&#x2F;&#x2F;arjkb.gitlab.io&#x2F;post&#x2F;2017-11-27-capture-packets-using-t-shark&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;arjkb.gitlab.io&#x2F;post&#x2F;2017-11-27-capture-packets-usin...</a>","time":1647851859,"type":"comment"},{"by":"dorianmariefr","id":30745453,"kids":[30746176,30757433],"parent":30743141,"text":"I prefer mitmproxy","time":1647802501,"type":"comment"},{"by":"rileymat2","id":30745450,"kids":[30745644],"parent":30743141,"text":"How does this work with perfect forward secrecy, does curl save all the keys?  Or is it disabled?","time":1647802482,"type":"comment"},{"by":"funshed","id":30746246,"kids":[30746566],"parent":30743141,"text":"I can&#x27;t figure out how to do virtualized android devices? any tips.","time":1647807834,"type":"comment"},{"by":"salmaanp","id":30746795,"parent":30743141,"text":"how would this work for custom applications? Say I have a C program which does openssl handshakes inside. How can we implement the same SSLKEYLOGFILE functionality in it","time":1647811420,"type":"comment"},{"by":"bigcat123","dead":true,"id":30748695,"parent":30743141,"time":1647823916,"type":"comment"},{"by":"throwra620","id":30743474,"kids":[30746122,30744147,30743976,30745238],"parent":30743141,"text":"This blog is awful to read. Wireshark will decrypt your ssl traffic automatic if you tell it to.","time":1647790315,"type":"comment"},{"by":"linsomniac","id":30743651,"kids":[30743957],"parent":30743141,"text":"(Sorry folks, was replying to the (at the time) only other comment about wireshark automatically doing decryption - edit)<p>This doesn&#x27;t work if you use DH, and you should be using DH.<p>To work with DH, you need to run your browser with a SSL key logfile, as discussed here:<p><a href=\"https:&#x2F;&#x2F;security.stackexchange.com&#x2F;questions&#x2F;35639&#x2F;decrypting-tls-in-wireshark-when-using-dhe-rsa-ciphersuites\" rel=\"nofollow\">https:&#x2F;&#x2F;security.stackexchange.com&#x2F;questions&#x2F;35639&#x2F;decryptin...</a>","time":1647791301,"type":"comment"},{"by":"lukasb","id":30727317,"kids":[30728162,30732329,30739165,30743582,30727747,30728021],"parent":30727052,"text":"Saw him speak at Berkeley around the time his book on the Eshin project was released. Talked in very strong terms about the importance of working in a holistic, caring way.<p>A SWE in the audience spoke up, saying basically &quot;look, we want to follow that approach, but it&#x27;s hard, we have a lot of stakeholders to satisfy in order for a project to happen.&quot;<p>Alexander was unyielding. &quot;Once you&#x27;ve worked with love, you won&#x27;t want to work in any other way.&quot;<p>YMMW on the practicality of his advice, but it was super inspiring.","time":1647636448,"type":"comment"},{"by":"dr_dshiv","id":30727638,"kids":[30732765,30760968,30728391,30733345,30731971,30728330],"parent":30727052,"text":"He had really interesting computational ideas about harmony. From <i>The Nature of Order</i> (2002) “As architects, builders, and artists, we are called upon constantly—every moment of the working day—to make judgments about relative harmony. We are constantly trying to make decisions about what is better and what is worse…”<p>Following this, he published a paper on “harmony-seeking computation” as an approach to optimize “wholeness.” He identified 15 elements of wholeness in designs that might be measured, like the presence of coherent centers, strong boundaries, local symmetries or roughness&#x2F;imperfection. He proposes that “the harmony that is sought in these computations is indeed what we otherwise call ‘beauty’. But the result of harmony-seeking computations are not merely pretty or artistic. In most cases, they are also better functionally and technically.”<p>Alexander,   Christopher &quot;Harmony-Seeking Computations.&quot; <i>International Journal of Unconventional Computing</i> 4 (2008).","time":1647638238,"type":"comment"},{"by":"jalfresi","id":30731932,"kids":[30738784],"parent":30727052,"text":"Very early in my software development career, i was frustrated and sad that i wasnt able to progress due to a lack of comprehension of how software is structured from smaller sub systems. I didnt have any kind of mentor available to me, and I seriously considered changing careers. I naively assumed that good software was written by naturally talented people, and because I was having problems growing I was obviously not talented and therefore would never get improve (I was young).<p>Then i stumbled across “Notes on the synthesis of form” from some random internet recommendation.<p>Not only was this book a complete eye opener, it helped me to understand so much about what I was doing was mostly by accident, and that design should be purposeful.<p>The most important lesson for my fledgling mind though was that design was a process, and a process that improved with each application. That good software developers arnt “born”, they are self sculpted.<p>I still have that battered, note riddled, page corners folded copy of “notes” and I take with me on holiday every year to re-read. Its my most favourite book I’ve ever read. It fills me with such inspiration everytime I read it.<p>I’m very sad to hear of Christophers passing. I never got to thank him.","time":1647675261,"type":"comment"},{"by":"shoo","id":30727369,"kids":[30731281,30727946],"parent":30727052,"text":"&gt; There is a central quality which is the root criterion of life and spirit in a man, a town, a building, or a wilderness. This quality is objective and precise, but it cannot be named. [...] It is not only simpler beauty of form and color. Man can make that without making nature. It is not only fitness to purpose. Man can make that too, without making nature. And it is not only the spiritual quality of beautiful music or of a quiet mosque, that comes from faith. Man can make that too, without making nature.<p>&gt; The quality which has no name includes these simpler sweeter qualities. But it is so ordinary as well, that it somehow reminds us of the passing of our life.<p>&gt; It is a slightly bitter quality.<p>- Christopher Alexander, The Timeless Way of Building","time":1647636749,"type":"comment"},{"by":"wnesensohn","id":30728231,"kids":[30728471],"parent":30727052,"text":"I&#x27;m glad I stumbled upon his books when researching design patterns early on in my career. His writing in &#x27;The Timeless Way of Building&#x27; left a big impression on me, precisely because it didn&#x27;t reduce building to a sequence of mechanical steps which are to be followed exactly, but allowed, even called for, gaining a deeper understanding for quality. It&#x27;s hard to express, but he did a stellar job at it.<p>It&#x27;s somewhat ironic that he is said to have laid the foundations of the design patterns movement which, I don&#x27;t know when, must have taken a series of wrong turns to end up where it did.<p>Thank you Mr. Alexander for writing about these fuzzy things which dare to be named.","time":1647641707,"type":"comment"},{"by":"karaterobot","id":30727816,"kids":[30735605,30730047,30728235],"parent":30727052,"text":"I just buy a new copy of <i>A Pattern Language</i> whenever I see it in a bookstore, because I know I&#x27;m going to end up giving it to someone. It&#x27;s one of those books you can confidently recommend to any curious, intelligent person, and it may change their thinking, or at least blow their mind, whether they find it useful or not. He was such an original thinker.","time":1647639157,"type":"comment"},{"by":"drallison","id":30731644,"kids":[30738504],"parent":30727052,"text":"Steve Hanna introduced me to Christopher Alexander&#x27;s work. I was consulting at Intel, writing the Intel 4004&#x2F;4040 native code assembler for the Intellec Microcomputer Development System. Steve and I shared a fascination in how systems and program get designed. Steve got me to read <i>Notes on the Synthesis of Form</i> and I was hooked. Somehow I&#x27;d missed it when it appeared in the <i>Whole Earth Catalog</i>. It certainly influenced my thinking. Years later, I got to know Christopher Alexander, the creative mind, and was continually surprised at how similar architecture and computer systems design are to each other.  Christopher came to Stanford and gave talks. He was inspiring and exciting.","time":1647671133,"type":"comment"},{"by":"nabla9","id":30727362,"kids":[30728970],"parent":30727052,"text":"I suggest that anyone interested in his work reads part I of &quot;The Patterns of Software&quot; by Richard Gabriel.  <a href=\"https:&#x2F;&#x2F;www.dreamsongs.com&#x2F;Files&#x2F;PatternsOfSoftware.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;www.dreamsongs.com&#x2F;Files&#x2F;PatternsOfSoftware.pdf</a><p>In my opinion, Gabriel has a better and deeper understanding of Christopher Alexander&#x27;s pattern language and how it can be applied to software than the whole Software Pattern movement which created a very different interpretation of patterns.","time":1647636703,"type":"comment"},{"by":"DyslexicAtheist","id":30729287,"parent":30727052,"text":"I have been citing &quot;A city is not a tree&quot;[1] whenever our product managers are getting too loud about how to make cities more livable by plugging IoT into all the things. The issues he calls out goes far beyond &quot;SmartCities&quot;. It&#x27;s everywhere in Tech.<p>[1] <a href=\"http:&#x2F;&#x2F;www.bp.ntu.edu.tw&#x2F;wp-content&#x2F;uploads&#x2F;2011&#x2F;12&#x2F;06-Alexander-A-city-is-not-a-tree.pdf\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bp.ntu.edu.tw&#x2F;wp-content&#x2F;uploads&#x2F;2011&#x2F;12&#x2F;06-Alexa...</a>","time":1647648240,"type":"comment"},{"by":"exolymph","id":30727249,"kids":[30727400,30728575,30733230,30727281,30727867],"parent":30727052,"text":"Massive PDF of A Pattern Language: <a href=\"https:&#x2F;&#x2F;arl.human.cornell.edu&#x2F;linked%20docs&#x2F;Alexander_A_Pattern_Language.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;arl.human.cornell.edu&#x2F;linked%20docs&#x2F;Alexander_A_Patt...</a><p>But I recommend owning and reading it in print. Great book to dip in and out of at whim.","time":1647636125,"type":"comment"},{"by":"motohagiography","id":30735086,"kids":[30740511,30738066],"parent":30727052,"text":"Every time I meet an architect or designer, I ask them about Alexander, and in the sample of about 12, only one (a world renowned architect) had heard of him. He&#x27;s hugely influential in software, and was a big influence on me in the 90&#x27;s and 00&#x27;s, along with Tufte, Hofstadter, and Feynman.<p>I think it was hacker culture that really bouyed his ideas and kept them in the popular consciousness, and in turn, his ideas became really foundational to  hacker culture as well. His passing is if not the loss of a pillar, it is at least a buttress.","time":1647707314,"type":"comment"},{"by":"rwmj","id":30727433,"kids":[30730377,30731939,30738292,30727536],"parent":30727052,"text":"He turns up in Stewart Brand&#x27;s excellent TV programme <i>How Buildings Learn</i>, which is also on Youtube: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;user&#x2F;brandst\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;user&#x2F;brandst</a>","time":1647637076,"type":"comment"},{"by":"wonder_er","id":30731137,"kids":[30732174,30733411],"parent":30727052,"text":"I had no idea Christopher Alexander was a software development luminary. I knew him via _A Pattern Language_, and I&#x27;m way more into architecture and physical space design than I am software. Now I&#x27;m mega interested to absorb his thoughts on software. I expect I&#x27;ll be much better for it.<p>He&#x27;s on my &quot;recommended reading&quot; list, I had _no_ idea he was so enmeshed in software: <a href=\"https:&#x2F;&#x2F;josh.works&#x2F;recommended-reading#a-pattern-language-towns-buildings-construction\" rel=\"nofollow\">https:&#x2F;&#x2F;josh.works&#x2F;recommended-reading#a-pattern-language-to...</a>","time":1647665201,"type":"comment"},{"by":"dumpsterlid","id":30760789,"parent":30727052,"text":"While Christopher Alexander will be mainly remembered for A Pattern Language, I do think he was onto some really interesting philosophical ideas in his attempt to define life as an analog (as in, not binary) value of structure. He didn&#x27;t have the words or precise knowledge to do it in The Nature Of Order series, but you can see him scratching at it.<p>Life is defined currently in a nebulous way that is primarily an internal property of an entity. When determining if an individual entity is alive we look inside it and dissect it into its components to determine whether they are organic.<p>I think what Alexander was trying to get at was that life is a presence of certain patterns. He identified these patterns through an architectural lens as 15 patterns. He is clear that there are less than 15, he just found it easier to teach these patterns to architectural students as 15 different patterns. These patterns are things like deep interlock between patterns (think of a complex carpet) strong borders and a diversity of scale in elements. Crucially these patterns are not an inherent property of some element, but rather a property that arises out of relationship with other elements.<p>I see a lot of truth in these ideas in that I think it makes far more sense to see life as an arrangement of matter into certain shapes that give rise to self-perpetuating and mutually reinforcing patterns. Christopher Alexander came at this idea from trying to articulate what exactly is so suffocating about modern architecture (and why it feels so anxiety inducing and alienating) but I think the implications are for Christopher Alexander characteristically broad.<p>I hope people like Nikos Salingaros continue going down this road.","time":1647903098,"type":"comment"},{"by":"drewda","id":30727970,"parent":30727052,"text":"Looks like the CNU web server is overwhelmed. I was able to read this at <a href=\"https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20220318203326&#x2F;https:&#x2F;&#x2F;www.cnu.org&#x2F;publicsquare&#x2F;2022&#x2F;03&#x2F;18&#x2F;christopher-alexander-1936-2022\" rel=\"nofollow\">https:&#x2F;&#x2F;web.archive.org&#x2F;web&#x2F;20220318203326&#x2F;https:&#x2F;&#x2F;www.cnu.o...</a>","time":1647640104,"type":"comment"},{"by":"Pamar","id":30733744,"parent":30727052,"text":"As many other here, I know about Christopher Alexander mostly from his influence on software theory and design.<p>Here you can find 12 of his &quot;real world&quot; works: <a href=\"https:&#x2F;&#x2F;www.re-thinkingthefuture.com&#x2F;design-studio-portfolios&#x2F;a2284-christopher-alexander-12-iconic-projects&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.re-thinkingthefuture.com&#x2F;design-studio-portfolio...</a>","time":1647698331,"type":"comment"},{"by":"xLaszlo","id":30727332,"kids":[30727892,30728275],"parent":30727052,"text":"This video of him from 1996 is amazing with hindsight. A must watch:\n<a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=98LdFA-_zfA\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=98LdFA-_zfA</a><p>RIP Christopher Alexander","time":1647636519,"type":"comment"},{"by":"leobg","id":30727428,"kids":[30727569],"parent":30727052,"text":"What a sad day. Never met him personally. But from what I heard this man’s influence has reached from architecture all the way to Wikipedia and Tesla. Unthinkable how different our world today would be if it hadn’t been for his work. May he rest in peace. And may his ideas continue to live, and mingle, and add color to our world.","time":1647637049,"type":"comment"},{"by":"galaxyLogic","id":30739597,"parent":30727052,"text":"I read about Alexander&#x27;s Norwegian barns and their &quot;quality without name&quot; and how that perhaps should apply to software too. And surely it applies, but in practice is not practiced very much.<p>One reason this might be is that software applications are more complicated things than barns. And the kind of complexity that matters here is not really in the implementation but in the interface. To design great applications I believe you have to consider that user is just one part of the &quot;system&quot;. It is not only software running on a computer, it is also software running in user&#x27;s head and fingers and the protocols users can and will use to interact with the rest of the system.<p>When you design a software application you must decide how much and what will the system do and how much and what will the user do. That is a complicated decision and it is not easy to come up with the optimal choice. Possibilities are almost endless.<p>We don&#x27;t usually consider the user as part of &quot;software&quot; but really they are, they are just parts in a bigger system with formal ways the user-part can and will interact with the computer-part of the system. Interaction with a barn is not trivial but quite simple compared to computer-based applications, I would think. But I agree the quality without a name is important to strive towards. It is, or would be, when everything seems to perfectly work together in different contexts and for different purposes.","time":1647744491,"type":"comment"},{"by":"loganwedwards","id":30728866,"parent":30727052,"text":"Notes on the Synthesis of Form provided intriguing insight into the theory and cultural impacts of design. As others have mentioned, he provided examples using architecture and biology. Quite fascinating albeit dry at times. Highly recommended. Thanks to the others for other reading suggestions.","time":1647645438,"type":"comment"},{"by":"yodon","id":30726673,"kids":[30727939,30727286,30727989,30733128,30726829,30727074,30726975,30733755,30729461,30732172,30727958,30726882,30727143],"parent":30725804,"text":"If you&#x27;re leaning towards stripping all your writing down to list form, you may want to read Tufte&#x27;s analysis on the role PowerPoint (aka writing everything in the form of bulleted lists) played in the Space Shuttle Challenger disaster [0]. I used to write exclusively in bulleted list&#x2F;outline format until spending time with Tufte&#x27;s analysis. Now I get that the connective tissue of the document is vitally important to the reader even if it&#x27;s not important to the writer. If you don&#x27;t put in the connective tissue, your reader has to do it for you and they&#x27;ll probably do it incorrectly (leading to, for example, the failure to prevent the Challenger disaster).<p>[0]<a href=\"https:&#x2F;&#x2F;www.inf.ed.ac.uk&#x2F;teaching&#x2F;courses&#x2F;pi&#x2F;2016_2017&#x2F;phil&#x2F;tufte-powerpoint.pdf\" rel=\"nofollow\">https:&#x2F;&#x2F;www.inf.ed.ac.uk&#x2F;teaching&#x2F;courses&#x2F;pi&#x2F;2016_2017&#x2F;phil&#x2F;...</a>","time":1647632985,"type":"comment"},{"by":"wrs","id":30726193,"kids":[30727147,30726617,30726645,30726398,30730170,30726928,30727644],"parent":30725804,"text":"Maybe I’m dating myself, but I was taught to start writing by coming up with an <i>outline</i>, which helps you organize your ideas into a coherent sequence. A list article basically makes its outline visible. The outline is also easily turned into an <i>introduction</i> that can address the non-list structure problem at the end of this article.","time":1647630268,"type":"comment"},{"by":"verve_rat","id":30728057,"kids":[30728954,30728300,30730669],"parent":30725804,"text":"This seems like an argument for using headings. The &quot;list&quot; part seems irrelevant.","time":1647640596,"type":"comment"},{"by":"rahimiali","id":30730700,"parent":30725804,"text":"The top comments aren’t doing the article justice. The article is really about the kinds of subjects that can be covered in depth as small sections that do not have dependencies between them. It explains the value of topics that can be presented this way, then explains these articles need to publicize this fact by claiming to be lists. Seriously well argued position and I recommend reading the whole thing.<p>Notability the article is not about hierarchical bulleted lists.","time":1647660625,"type":"comment"},{"by":"swah","id":30733008,"parent":30725804,"text":"<p><pre><code>    - Lists are appealing\n    - Lists promise value quickly\n    - Lists promise different types of value\n    - Lists promise limited complexity\n    - Lists promise many entrance points\n    - A list is a contract between the writer and reader\n    - A list promises “list-tractability”\n    - How to stop worrying\n</code></pre>\nAlso:<p><pre><code>    - I only had to read those headings and check the images to read this article in under a minute. \n    - I&#x27;ll never know if something was lost. \n    - Youtube also has lists nowadays. \n    - I&#x27;m a skimmer and I feel bad.\n    - I opened a book yesterday and it was very relaxing.</code></pre>","time":1647690193,"type":"comment"},{"by":"bryanrasmussen","id":30729590,"kids":[30731574],"parent":30725804,"text":"hmm, which of these two am I drawn to:<p>&gt;“Theory and practice of effective sleep”<p>&gt;“Seven insights about sleep”<p>hmm, the first one sounds like an in-depth exhaustive text on the subject that if I have the time to read it I will definitely learn something from.<p>The second sounds like SEO listicle crap at least 5 of which insights will be really obvious things that only an idiot would need explained to them, 1 of which will sound deep and insightful but if I read the first text will turn out to have been misinterpreted and actually mean almost the obvious of what is supposed, and 1 of which might be slightly helpful.<p>I think I might want to read the first, but only if I really want to learn something about sleep, and I might read the second one for some reason at some point and immediately think why do I waste my time with this stuff.","time":1647650453,"type":"comment"},{"by":"exolymph","id":30727293,"parent":30725804,"text":"Myself, I tend toward flowery prose with copious clauses and parentheticals. But listing — or building out a list into an essay — is an incredibly effective communication tactic. I would rather have people write lists than write nothing, and for most writers, I would also rather read their boiled-down lists than their hilariously padded nonfiction books.","time":1647636336,"type":"comment"},{"by":"andreshb","id":30726664,"kids":[30728405,30727351,30726706],"parent":30725804,"text":"Lists make writing easier<p>1. I write ideas without worrying about transitions<p>2. I can quickly review if I’m missing any important point<p>3. Forces me to simplify what I try to communicate with less words and more meaning","time":1647632941,"type":"comment"},{"by":"jerf","id":30726666,"parent":30725804,"text":"I absolutely agree that any writing much past one normal monitor&#x27;s worth of writing could use more structure than just a pile of paragraphs. (Though a pile of paragraphs is still much better than a pile of sentences!)<p>But it is a strange leap from &quot;Too much writing without more structure is hard to read&quot; to &quot;You should use lists specifically&quot;. It&#x27;s perfectly valid to use, you know, headers. Subheaders. Actual lists, bulleted and ordered. Horizontal rules if you&#x27;re feeling feisty and&#x2F;or old school. Essayist does try to give motivations but I feel like there was significant cheating by comparing lists to unstructured essays. Lists vs. structured essays are a much more give &amp; take situation, where lists only triumph in certain limited ways.","time":1647632973,"type":"comment"},{"by":"zwieback","id":30726343,"parent":30725804,"text":"Agree up to a point. When I see &quot;37 x about y&quot; I keep scrolling. It has to be a reasonable number of items.<p>I love lists for emails - whenever I write an email that mentions more than one point I put everything in numbered paragraphs. Sometimes I also do 1) 2) 3) for information and a) b) c) for questions that refer back to the numbered list. Makes it a lot easier for followups to stay on track.","time":1647630986,"type":"comment"},{"by":"submeta","id":30732966,"parent":30725804,"text":"I was an avid user of outliner apps myself (Netmanage&#x27;s ECCO Pro some twenty years ago, later OmniOutliner on my Mac, and recently Emacs&#x2F;Org or Roam Research), until I realized that trying to distill my ideas down to the core structure, the narrative of what I am trying to tell get&#x27;s lost. This is something that Jeff Bezos laments about PowerPoint [1]:<p>&#x2F;quote&#x2F;<p>Anytime an Amazon worker has an idea to discuss, they’re asked to structure their pitch in the form of a 4-6 page memo, which the company calls a “narrative.”<p>Well structured, narrative text is what we’re after rather than just text. If someone builds a list of bullet points in word, that would be just as bad as powerpoint.<p>The reason writing a 4 page memo is harder than “writing” a 20 page powerpoint is because the narrative structure of a good memo forces better thought and better understanding of what’s more important than what, and how things are related.<p>Powerpoint-style presentations somehow give permission to gloss over ideas, flatten out any sense of relative importance, and ignore the innerconnectedness of ideas.<p>&#x2F;unquote&#x2F;<p>I value outliners a lot, but when I started writing down my ideas in full sentences, I was forced to create arguments more clearly and explicitly, and that helps me get clearer about my problem domain.<p>[1]: <a href=\"https:&#x2F;&#x2F;www.businessinsider.com.au&#x2F;jeff-bezos-email-against-powerpoint-presentations-2015-7\" rel=\"nofollow\">https:&#x2F;&#x2F;www.businessinsider.com.au&#x2F;jeff-bezos-email-against-...</a>","time":1647689578,"type":"comment"},{"by":"leokennis","id":30732756,"parent":30725804,"text":"I at least make sure all my work mails are numbered lists:<p>1. Easy for replies to refer to a certain portion of my mail (just mention the number)<p>2. Lists result in shorter emails with less fluff - always an advantage for work related communication<p>3. Especially for people with less writing skills, lists make it clearer what the priorities are. “Item 4” is of more importance than “Item 2b”. If you’re only using words, you need mastery of language to convey that.","time":1647686875,"type":"comment"},{"by":"atweiden","id":30731774,"parent":30725804,"text":"Check out vim-journal [1] if you really want to take this to the next level.<p>The plugin’s kaleidoscopic colour functionality visually incentivizes writing in list format constantly. The colours are enjoyable to look at, and you get more of them on your screen each time you indent a list item.<p><pre><code>    which\n    - makes you organize your thoughts differently\n      - because\n        - the more colour, the better\n      - e.g.\n        - you’ll want to write like this\n</code></pre>\n[1]: <a href=\"https:&#x2F;&#x2F;github.com&#x2F;junegunn&#x2F;vim-journal\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;junegunn&#x2F;vim-journal</a>","time":1647673138,"type":"comment"},{"by":"underwater","id":30728373,"parent":30725804,"text":"Lists are great, but shouldn&#x27;t be used for everything.<p>This article is a perfect example. These items are all supporting a thesis that the visual nature of lists provides clear value to the reader. The author asserts lists &quot;allow readers to quickly and easily get what they want&quot;. But the text doesn&#x27;t take the time to properly establish why that is the most important property of writing.<p>Because the author hasn&#x27;t properly sold the core idea, the subsequent list items just come across as a shotgun approach. It seems as though the author thinks that it they throw out enough ideas one of them will stick, or that the reader will assume that the sheer volume of points means the idea is solid.","time":1647642536,"type":"comment"},{"by":"mwattsun","id":30730257,"parent":30725804,"text":"A starting point for exploring Wikipedia is &quot;List of lists of lists&quot;<p><a href=\"https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_lists_of_lists\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;List_of_lists_of_lists</a>","time":1647656018,"type":"comment"},{"by":"justinlloyd","id":30728288,"parent":30725804,"text":"I don&#x27;t like lists.<p>Written lists.<p>Lists written out to try and impart knowledge and information to the reader.<p>I do like being able to dip in to things, in an exploratory, unconnected fashion, but lists, especially in modern SEO writing for the web, have turned in to some bastardized version of useful information.<p>My usual train of thought is &quot;a list that isn&#x27;t a list&quot;, e.g. <a href=\"https:&#x2F;&#x2F;justinlloyd.li&#x2F;blog&#x2F;3d-printer-purchase&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;justinlloyd.li&#x2F;blog&#x2F;3d-printer-purchase&#x2F;</a> for a 3D printer purchase or my three year long train of thought on prime number research at <a href=\"https:&#x2F;&#x2F;justinlloyd.li&#x2F;blog&#x2F;prime-numbers&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;justinlloyd.li&#x2F;blog&#x2F;prime-numbers&#x2F;</a>.<p>On a side note, when I am writing a lengthy article, I usually assemble a list of bullet points first, the outline, and then convert the bullet points into prose, and then re-order the prose, then edit the prose so that it flows.<p>But I think lists are a terrible, terrible travesty of the modern web, because they are so abused.<p>And bullet pointed lists in a presentation, I consider those kinds of things to be used by people who don&#x27;t understand the subject, to teach people even less knowledgable about the subject, everything that they know. Which ain&#x27;t much.","time":1647641990,"type":"comment"},{"by":"hintymad","id":30727327,"kids":[30727458],"parent":30725804,"text":"&gt;  It’s because there ain’t no way to re-write mathematical analysis as a “list”.\nWhen you do write a list, you are promising that you’ve figured out a way to cover the subject in that way without losing essential detail.<p>I&#x27;m not sure this works out for a math textbook, or any book at all. We build our understanding and knowledge by layering up abstractions, and the abstractions form a graph. A linear list to cover all the preqreq will be tedious and repetitive, to say the least.","time":1647636483,"type":"comment"},{"by":"tempestn","id":30727920,"parent":30725804,"text":"Was going to comment on the irony of this not being a list, then got to the excellent final line.","time":1647639762,"type":"comment"},{"by":"MarkLowenstein","id":30728684,"parent":30725804,"text":"I believe the major advantage of lists is that they make it easy to block out all the chaff from the rest of the prose, allowing you to comfortably concentrate on the current item. That&#x27;s the same advantage provided by <i>well-chosen</i> taxonomies. Also I think the best UIs are defined by how well they help you identify the areas which you can ignore. I wish this were an explicit priority for designers.","time":1647644240,"type":"comment"},{"by":"jzer0cool","id":30727080,"parent":30725804,"text":"This is because we are living in a system built upon filtering out noise.   Also, to filter out from sensory overflow.","time":1647635191,"type":"comment"}]